-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 19 2025 г., 21:33
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `StreamingCepuDB`
--

-- --------------------------------------------------------

--
-- Структура таблицы `authtoken_token`
--

CREATE TABLE `authtoken_token` (
  `key` varchar(40) NOT NULL,
  `created` datetime(6) NOT NULL,
  `user_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `auth_group`
--

CREATE TABLE `auth_group` (
  `id` int NOT NULL,
  `name` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `auth_group_permissions`
--

CREATE TABLE `auth_group_permissions` (
  `id` bigint NOT NULL,
  `group_id` int NOT NULL,
  `permission_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `auth_permission`
--

CREATE TABLE `auth_permission` (
  `id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `content_type_id` int NOT NULL,
  `codename` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `auth_permission`
--

INSERT INTO `auth_permission` (`id`, `name`, `content_type_id`, `codename`) VALUES
(1, 'Can add log entry', 1, 'add_logentry'),
(2, 'Can change log entry', 1, 'change_logentry'),
(3, 'Can delete log entry', 1, 'delete_logentry'),
(4, 'Can view log entry', 1, 'view_logentry'),
(5, 'Can add permission', 2, 'add_permission'),
(6, 'Can change permission', 2, 'change_permission'),
(7, 'Can delete permission', 2, 'delete_permission'),
(8, 'Can view permission', 2, 'view_permission'),
(9, 'Can add group', 3, 'add_group'),
(10, 'Can change group', 3, 'change_group'),
(11, 'Can delete group', 3, 'delete_group'),
(12, 'Can view group', 3, 'view_group'),
(13, 'Can add user', 4, 'add_user'),
(14, 'Can change user', 4, 'change_user'),
(15, 'Can delete user', 4, 'delete_user'),
(16, 'Can view user', 4, 'view_user'),
(17, 'Can add content type', 5, 'add_contenttype'),
(18, 'Can change content type', 5, 'change_contenttype'),
(19, 'Can delete content type', 5, 'delete_contenttype'),
(20, 'Can view content type', 5, 'view_contenttype'),
(21, 'Can add session', 6, 'add_session'),
(22, 'Can change session', 6, 'change_session'),
(23, 'Can delete session', 6, 'delete_session'),
(24, 'Can view session', 6, 'view_session'),
(25, 'Can add film', 7, 'add_film'),
(26, 'Can change film', 7, 'change_film'),
(27, 'Can delete film', 7, 'delete_film'),
(28, 'Can view film', 7, 'view_film'),
(29, 'Can add genre', 8, 'add_genre'),
(30, 'Can change genre', 8, 'change_genre'),
(31, 'Can delete genre', 8, 'delete_genre'),
(32, 'Can view genre', 8, 'view_genre'),
(33, 'Can add user', 9, 'add_user'),
(34, 'Can change user', 9, 'change_user'),
(35, 'Can delete user', 9, 'delete_user'),
(36, 'Can view user', 9, 'view_user'),
(37, 'Can add comment', 10, 'add_comment'),
(38, 'Can change comment', 10, 'change_comment'),
(39, 'Can delete comment', 10, 'delete_comment'),
(40, 'Can view comment', 10, 'view_comment'),
(41, 'Can add film genre', 11, 'add_filmgenre'),
(42, 'Can change film genre', 11, 'change_filmgenre'),
(43, 'Can delete film genre', 11, 'delete_filmgenre'),
(44, 'Can view film genre', 11, 'view_filmgenre'),
(45, 'Can add rating', 12, 'add_rating'),
(46, 'Can change rating', 12, 'change_rating'),
(47, 'Can delete rating', 12, 'delete_rating'),
(48, 'Can view rating', 12, 'view_rating'),
(49, 'Can add like', 13, 'add_like'),
(50, 'Can change like', 13, 'change_like'),
(51, 'Can delete like', 13, 'delete_like'),
(52, 'Can view like', 13, 'view_like'),
(53, 'Can add watch history', 14, 'add_watchhistory'),
(54, 'Can change watch history', 14, 'change_watchhistory'),
(55, 'Can delete watch history', 14, 'delete_watchhistory'),
(56, 'Can view watch history', 14, 'view_watchhistory'),
(57, 'Can add Token', 15, 'add_token'),
(58, 'Can change Token', 15, 'change_token'),
(59, 'Can delete Token', 15, 'delete_token'),
(60, 'Can view Token', 15, 'view_token'),
(61, 'Can add Token', 16, 'add_tokenproxy'),
(62, 'Can change Token', 16, 'change_tokenproxy'),
(63, 'Can delete Token', 16, 'delete_tokenproxy'),
(64, 'Can view Token', 16, 'view_tokenproxy'),
(65, 'Can add user profile', 17, 'add_userprofile'),
(66, 'Can change user profile', 17, 'change_userprofile'),
(67, 'Can delete user profile', 17, 'delete_userprofile'),
(68, 'Can view user profile', 17, 'view_userprofile'),
(69, 'Can add access attempt', 18, 'add_accessattempt'),
(70, 'Can change access attempt', 18, 'change_accessattempt'),
(71, 'Can delete access attempt', 18, 'delete_accessattempt'),
(72, 'Can view access attempt', 18, 'view_accessattempt'),
(73, 'Can add access log', 19, 'add_accesslog'),
(74, 'Can change access log', 19, 'change_accesslog'),
(75, 'Can delete access log', 19, 'delete_accesslog'),
(76, 'Can view access log', 19, 'view_accesslog'),
(77, 'Can add access failure', 20, 'add_accessfailurelog'),
(78, 'Can change access failure', 20, 'change_accessfailurelog'),
(79, 'Can delete access failure', 20, 'delete_accessfailurelog'),
(80, 'Can view access failure', 20, 'view_accessfailurelog');

-- --------------------------------------------------------

--
-- Структура таблицы `auth_user`
--

CREATE TABLE `auth_user` (
  `id` int NOT NULL,
  `password` varchar(128) NOT NULL,
  `last_login` datetime(6) DEFAULT NULL,
  `is_superuser` tinyint(1) NOT NULL,
  `username` varchar(150) NOT NULL,
  `first_name` varchar(150) NOT NULL,
  `last_name` varchar(150) NOT NULL,
  `email` varchar(254) NOT NULL,
  `is_staff` tinyint(1) NOT NULL,
  `is_active` tinyint(1) NOT NULL,
  `date_joined` datetime(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `auth_user`
--

INSERT INTO `auth_user` (`id`, `password`, `last_login`, `is_superuser`, `username`, `first_name`, `last_name`, `email`, `is_staff`, `is_active`, `date_joined`) VALUES
(1, 'pbkdf2_sha256$870000$FftCc0pYnSxQYriCUebzA0$hNf6QFx8etODCTHMfrxyhwKVuBMJUyFc5MusJmcFbiU=', '2025-05-16 20:37:53.922528', 1, 'mako', '', '', 'danyushis.m.i.21@gmail.com', 1, 1, '2025-02-05 14:51:11.916911'),
(2, 'pbkdf2_sha256$870000$Kp4Ye3X3PF8if4bF9SvzsP$GwzZCT525BFxWCYBExes0QoB4Ta41cthqdgZZAmb/bo=', NULL, 0, 'Georgia', 'Георгий', 'Гришин', 'georgia@gmail.com', 0, 1, '2025-02-07 17:31:24.622768'),
(4, 'pbkdf2_sha256$870000$mY2RozMGqVx04aw6eLOtuG$PH/jmcpS0MFyCFzOs9k7Ut9hAb40f+kQPAAD8ydcjiU=', NULL, 0, 'Evgeny808', '', '', 'zxvzxcvzc@gmail.com', 0, 1, '2025-02-07 20:20:40.451411'),
(5, 'pbkdf2_sha256$870000$tfsDeSc4iOaTpHJQJqRZcI$67bC1m0ffugw8uVOZWpZldUivLLdNjAQnTqYOMu7HiM=', NULL, 0, 'Arsenixxx', '', '', 'asdkjns@gam.com', 0, 1, '2025-02-07 20:53:43.873616'),
(6, 'pbkdf2_sha256$870000$ffnNd2pgVnwuMttQ2w0n39$qXZmo05rN7BC+S82g9h2qRdFJKQjmMrsUgye4PlrWIs=', NULL, 0, 'DanilRomashkan', 'Данил', 'Ромашкан', 'romashkan@gmail.com', 0, 1, '2025-02-08 17:32:01.000000'),
(7, 'pbkdf2_sha256$870000$0sbgEyVUSPNDxMmamV1Gkf$qCEM25ZdOdIod9l22bV1yWOOoajuLFSzLh6v9S8V6mA=', NULL, 0, 'Akolit811A', '', '', 'mako@amg.com', 0, 1, '2025-02-23 22:13:16.312978'),
(8, 'pbkdf2_sha256$870000$iOdialG8z5UgB5iP3lvfps$GTzz4LKkG+PayGyjeGdwRh3hdyx/d42chQZhdzgifxc=', NULL, 0, 'MakoSinchik', 'Мако', 'Сжаковский', '23few@gmai.com', 0, 1, '2025-02-24 00:54:19.945703'),
(10, 'pbkdf2_sha256$870000$LTnScb3levjsZrO9oIs8Oe$VrTZFJfbqJwcYc931726wR69C4nEq8edtH1uNVrkD4c=', NULL, 0, 'EdemOsmanov', 'Эдем', 'Османов', 'edemosmanov1536@gmail.com', 0, 1, '2025-02-27 16:03:31.504524'),
(12, 'pbkdf2_sha256$870000$VnoQZsBithx3QWuQzn1NhA$BKoH2Nh5AQSBA/97+ceYyhXHwKrJZIhCE+6+VO+j/RE=', NULL, 0, 'EdemOsmanov12', '', '', 'kmsdf@gmail.com', 0, 1, '2025-05-06 14:14:11.704282'),
(13, 'pbkdf2_sha256$870000$IljjmYXNyNaeGxHz2AGvUL$QjGMt9TuLRmtBq8Wk8GpGUCPvqOl4Mox1C17G+2hbNY=', NULL, 0, 'EdemOsmanov1', '', '', 'EdemOsmanov1@gmail.com', 0, 1, '2025-05-06 14:20:00.504884'),
(14, 'pbkdf2_sha256$870000$Xqm5TVuJNxxQPjL7tKfggo$EwdT07WForw0LLRi9kIP9K4Uw/OIgGu5S8mjcrgtKtk=', NULL, 0, 'Starlight11', '', '', 'seom223sm@mail.ru', 0, 1, '2025-05-06 15:04:00.142820'),
(17, 'pbkdf2_sha256$870000$y8TtIOWrunU9bzijFK1lWT$qiTnvWSLUENipGvHRGtLrp2lC3bbFSY2IdkNe1Xbm6w=', NULL, 0, 'Vitaly003', 'Виталий', 'Шагин', 'Vitaly003@gmail.com', 0, 1, '2025-05-16 20:44:56.467654'),
(18, 'pbkdf2_sha256$870000$CqXHak6mxLQ924LLG96JsD$/JCWmYh0GY0ydZR7uGJiY3YKBKeWiU1Me77c6Ahxzj4=', NULL, 0, 'MaksimDanyushis', 'Максим', 'Данюшис', 'danyushis.m.i.21@gmail.com', 0, 1, '2025-05-18 17:07:45.316967');

-- --------------------------------------------------------

--
-- Структура таблицы `auth_user_groups`
--

CREATE TABLE `auth_user_groups` (
  `id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `group_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `auth_user_user_permissions`
--

CREATE TABLE `auth_user_user_permissions` (
  `id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `permission_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `axes_accessattempt`
--

CREATE TABLE `axes_accessattempt` (
  `id` int NOT NULL,
  `user_agent` varchar(255) NOT NULL,
  `ip_address` char(39) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `http_accept` varchar(1025) NOT NULL,
  `path_info` varchar(255) NOT NULL,
  `attempt_time` datetime(6) NOT NULL,
  `get_data` longtext NOT NULL,
  `post_data` longtext NOT NULL,
  `failures_since_start` int UNSIGNED NOT NULL
) ;

--
-- Дамп данных таблицы `axes_accessattempt`
--

INSERT INTO `axes_accessattempt` (`id`, `user_agent`, `ip_address`, `username`, `http_accept`, `path_info`, `attempt_time`, `get_data`, `post_data`, `failures_since_start`) VALUES
(16, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/133.0.0.0 Safari/537.36 OPR/118.0.0.0', '127.0.0.1', 'vitalywii03', 'application/json, text/plain, */*', '/api/token/', '2025-05-16 20:44:09.775488', '', '', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `axes_accessfailurelog`
--

CREATE TABLE `axes_accessfailurelog` (
  `id` int NOT NULL,
  `user_agent` varchar(255) NOT NULL,
  `ip_address` char(39) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `http_accept` varchar(1025) NOT NULL,
  `path_info` varchar(255) NOT NULL,
  `attempt_time` datetime(6) NOT NULL,
  `locked_out` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `axes_accesslog`
--

CREATE TABLE `axes_accesslog` (
  `id` int NOT NULL,
  `user_agent` varchar(255) NOT NULL,
  `ip_address` char(39) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `http_accept` varchar(1025) NOT NULL,
  `path_info` varchar(255) NOT NULL,
  `attempt_time` datetime(6) NOT NULL,
  `logout_time` datetime(6) DEFAULT NULL,
  `session_hash` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `axes_accesslog`
--

INSERT INTO `axes_accesslog` (`id`, `user_agent`, `ip_address`, `username`, `http_accept`, `path_info`, `attempt_time`, `logout_time`, `session_hash`) VALUES
(1, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/133.0.0.0 Safari/537.36 OPR/118.0.0.0', '127.0.0.1', 'mako', 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7', '/admin/login/', '2025-05-12 18:46:05.101143', NULL, 'e29edb09fc28f94fac9c63a35e9b6954a4d67b1b1e4cd55e4c41358e33cf9651'),
(2, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/133.0.0.0 Safari/537.36 OPR/118.0.0.0', '127.0.0.1', 'mako', 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7', '/admin/login/', '2025-05-16 20:37:53.927490', NULL, 'e248cbf7b7d6e576f02eec2c6345b124efafd6c3c89d5d3919ee96303ff0ed33');

-- --------------------------------------------------------

--
-- Структура таблицы `core_comment`
--

CREATE TABLE `core_comment` (
  `id` bigint NOT NULL,
  `text` longtext NOT NULL,
  `created_at` datetime(6) NOT NULL,
  `film_id` bigint NOT NULL,
  `user_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_comment`
--

INSERT INTO `core_comment` (`id`, `text`, `created_at`, `film_id`, `user_id`) VALUES
(1, 'пмролмо', '2025-02-27 18:51:03.000000', 27, 6),
(2, 'пмролмо', '2025-02-27 18:51:03.000000', 27, 6),
(3, 'чсмчсм', '2025-03-08 17:24:22.528990', 5, 6),
(4, 'исчсмичсми', '2025-03-08 17:24:35.815514', 5, 6),
(5, 'чсмичсмчсми', '2025-03-08 17:24:40.724745', 5, 6),
(6, 'Буду смотреть', '2025-03-08 17:35:25.338322', 27, 10),
(8, 'Нормально', '2025-03-08 17:52:09.707635', 4, 10),
(9, 'Неплохо ! !', '2025-03-08 18:16:53.077821', 5, 10),
(10, 'Актерская игра на высоте!', '2024-05-09 22:31:39.000000', 4, 4),
(11, 'Нудный, еле досмотрел.', '2025-02-26 22:31:39.000000', 4, 6),
(12, 'Интересный, но пересматривать не буду.', '2024-06-26 22:31:39.000000', 4, 4),
(13, 'Не понравился финал.', '2025-02-18 22:31:39.000000', 4, 1),
(14, 'Сюжет непредсказуемый, круто!', '2025-02-02 22:31:39.000000', 4, 7),
(15, 'Не зашло, ожидал большего.', '2025-03-05 22:31:39.000000', 4, 2),
(16, 'Актерская игра на высоте!', '2025-02-24 22:31:39.000000', 4, 5),
(17, 'Отличный фильм, всем советую!', '2024-04-29 22:31:39.000000', 4, 8),
(18, 'Очень атмосферный фильм.', '2024-08-01 22:31:39.000000', 4, 4),
(19, 'Хороший сюжет, интересные персонажи.', '2024-04-28 22:31:39.000000', 4, 1),
(20, 'Не понравился финал.', '2024-07-18 22:31:39.000000', 5, 4),
(21, 'Не зашло, ожидал большего.', '2024-09-24 22:31:39.000000', 5, 2),
(22, 'Музыка в фильме шикарная!', '2024-08-12 22:31:39.000000', 5, 4),
(23, 'Музыка в фильме шикарная!', '2024-09-05 22:31:39.000000', 5, 1),
(24, 'Нудный, еле досмотрел.', '2024-04-11 22:31:39.000000', 5, 1),
(25, 'Актерская игра на высоте!', '2024-10-03 22:31:39.000000', 5, 4),
(26, 'Крутые спецэффекты, но сюжет слабый.', '2024-03-31 22:31:39.000000', 5, 8),
(27, 'Можно смотреть в компании.', '2024-08-01 22:31:39.000000', 5, 6),
(28, 'Нудный, еле досмотрел.', '2024-03-29 22:31:39.000000', 5, 4),
(29, 'Сюжетная линия слабовата.', '2025-03-03 22:31:39.000000', 5, 6),
(30, 'Можно смотреть в компании.', '2024-08-28 22:31:39.000000', 6, 10),
(31, 'Рекомендую к просмотру.', '2024-09-21 22:31:39.000000', 6, 5),
(32, 'Не понравился финал.', '2025-01-30 22:31:39.000000', 6, 1),
(33, 'Ждал большего от концовки.', '2024-07-04 22:31:39.000000', 6, 8),
(34, 'Актеры сыграли отлично.', '2024-06-01 22:31:39.000000', 6, 4),
(35, 'Крутые спецэффекты, но сюжет слабый.', '2024-11-24 22:31:39.000000', 6, 5),
(36, 'Музыка в фильме шикарная!', '2024-12-21 22:31:39.000000', 6, 4),
(37, 'Фильм скучноват, ожидал большего.', '2024-12-26 22:31:39.000000', 6, 8),
(38, 'Интересный, но пересматривать не буду.', '2024-10-28 22:31:39.000000', 6, 4),
(39, 'Очень понравилось, особенно концовка!', '2024-03-22 22:31:39.000000', 6, 4),
(40, 'Можно смотреть в компании.', '2024-10-31 22:31:39.000000', 7, 5),
(41, 'Нудный, еле досмотрел.', '2024-07-22 22:31:39.000000', 7, 6),
(42, 'Музыка в фильме шикарная!', '2025-01-24 22:31:39.000000', 7, 10),
(43, 'Не зашло, ожидал большего.', '2024-07-28 22:31:39.000000', 7, 10),
(44, 'Сюжет непредсказуемый, круто!', '2024-06-16 22:31:39.000000', 7, 4),
(45, 'Фильм оставляет приятное впечатление.', '2025-03-06 22:31:39.000000', 7, 2),
(46, 'Рекомендую к просмотру.', '2024-06-22 22:31:39.000000', 7, 1),
(47, 'Хороший сюжет, интересные персонажи.', '2024-12-31 22:31:39.000000', 7, 6),
(48, 'Сюжетная линия слабовата.', '2024-06-08 22:31:39.000000', 7, 1),
(49, 'Не зашло, ожидал большего.', '2024-11-30 22:31:39.000000', 7, 2),
(50, 'Сюжет непредсказуемый, круто!', '2024-09-15 22:31:39.000000', 8, 10),
(51, 'Рекомендую к просмотру.', '2024-10-10 22:31:39.000000', 8, 4),
(52, 'Очень атмосферный фильм.', '2025-02-06 22:31:39.000000', 8, 7),
(53, 'Актерская игра на высоте!', '2024-06-15 22:31:39.000000', 8, 5),
(54, 'Не зашло, ожидал большего.', '2024-03-20 22:31:39.000000', 8, 6),
(55, 'Можно смотреть в компании.', '2024-05-26 22:31:39.000000', 8, 10),
(56, 'Отличный фильм, всем советую!', '2024-11-13 22:31:39.000000', 8, 7),
(57, 'Рекомендую к просмотру.', '2024-10-29 22:31:39.000000', 8, 7),
(58, 'Можно смотреть в компании.', '2024-12-23 22:31:39.000000', 8, 7),
(59, 'Актерская игра на высоте!', '2024-05-20 22:31:39.000000', 8, 7),
(60, 'Музыка в фильме шикарная!', '2024-12-21 22:31:39.000000', 9, 10),
(61, 'Не зашло, ожидал большего.', '2024-07-04 22:31:39.000000', 9, 10),
(62, 'Сюжет непредсказуемый, круто!', '2024-07-10 22:31:39.000000', 9, 5),
(63, 'Не зашло, ожидал большего.', '2024-07-16 22:31:39.000000', 9, 8),
(64, 'Актерская игра на высоте!', '2024-11-17 22:31:39.000000', 9, 7),
(65, 'Фильм скучноват, ожидал большего.', '2025-02-07 22:31:39.000000', 9, 10),
(66, 'Музыка в фильме шикарная!', '2024-12-16 22:31:39.000000', 9, 6),
(67, 'Рекомендую к просмотру.', '2025-01-30 22:31:39.000000', 9, 6),
(68, 'Ждал большего от концовки.', '2025-01-26 22:31:39.000000', 9, 8),
(69, 'Отличный фильм, всем советую!', '2024-09-24 22:31:39.000000', 9, 5),
(70, 'Рекомендую к просмотру.', '2024-07-28 22:31:39.000000', 10, 2),
(71, 'Очень атмосферный фильм.', '2024-08-03 22:31:39.000000', 10, 7),
(72, 'Хороший сюжет, интересные персонажи.', '2024-09-28 22:31:39.000000', 10, 2),
(73, 'Не зашло, ожидал большего.', '2024-06-01 22:31:39.000000', 10, 8),
(74, 'Актеры сыграли отлично.', '2024-04-13 22:31:39.000000', 10, 10),
(75, 'Актерская игра на высоте!', '2024-12-15 22:31:39.000000', 10, 7),
(76, 'Рекомендую к просмотру.', '2024-11-17 22:31:39.000000', 10, 2),
(77, 'Сюжет непредсказуемый, круто!', '2024-09-23 22:31:39.000000', 10, 5),
(78, 'Фильм оставляет приятное впечатление.', '2024-07-15 22:31:39.000000', 10, 8),
(79, 'Музыка в фильме шикарная!', '2024-10-05 22:31:39.000000', 10, 2),
(80, 'Очень понравилось, особенно концовка!', '2024-11-26 22:31:39.000000', 11, 6),
(81, 'Рекомендую к просмотру.', '2024-07-03 22:31:39.000000', 11, 8),
(82, 'Актерская игра на высоте!', '2024-07-12 22:31:39.000000', 11, 6),
(83, 'Не понравился финал.', '2024-06-06 22:31:39.000000', 11, 8),
(84, 'Очень понравилось, особенно концовка!', '2024-10-28 22:31:39.000000', 11, 5),
(85, 'Фильм оставляет приятное впечатление.', '2024-06-15 22:31:39.000000', 11, 4),
(86, 'Крутые спецэффекты, но сюжет слабый.', '2024-08-15 22:31:39.000000', 11, 10),
(87, 'Крутые спецэффекты, но сюжет слабый.', '2024-04-02 22:31:39.000000', 11, 5),
(88, 'Крутые спецэффекты, но сюжет слабый.', '2025-03-01 22:31:39.000000', 11, 1),
(89, 'Очень атмосферный фильм.', '2024-10-02 22:31:39.000000', 11, 10),
(90, 'Можно смотреть в компании.', '2024-04-20 22:31:39.000000', 12, 5),
(91, 'Интересный, но пересматривать не буду.', '2024-04-09 22:31:39.000000', 12, 6),
(92, 'Можно смотреть в компании.', '2024-09-25 22:31:39.000000', 12, 8),
(93, 'Рекомендую к просмотру.', '2024-10-27 22:31:39.000000', 12, 4),
(94, 'Очень понравилось, особенно концовка!', '2024-03-23 22:31:39.000000', 12, 5),
(95, 'Актеры сыграли отлично.', '2024-11-16 22:31:39.000000', 12, 7),
(96, 'Очень атмосферный фильм.', '2024-04-09 22:31:39.000000', 12, 4),
(97, 'Можно смотреть в компании.', '2024-12-31 22:31:39.000000', 12, 7),
(98, 'Рекомендую к просмотру.', '2025-01-03 22:31:39.000000', 12, 7),
(99, 'Очень понравилось, особенно концовка!', '2024-07-27 22:31:39.000000', 12, 7),
(100, 'Очень атмосферный фильм.', '2024-09-06 22:31:39.000000', 13, 2),
(101, 'Музыка в фильме шикарная!', '2024-09-03 22:31:39.000000', 13, 5),
(102, 'Фильм скучноват, ожидал большего.', '2024-04-01 22:31:39.000000', 13, 8),
(103, 'Актерская игра на высоте!', '2024-03-18 22:31:39.000000', 13, 8),
(104, 'Не зашло, ожидал большего.', '2024-03-31 22:31:39.000000', 13, 5),
(105, 'Не зашло, ожидал большего.', '2024-11-13 22:31:39.000000', 13, 6),
(106, 'Отличный фильм, всем советую!', '2025-01-01 22:31:39.000000', 13, 2),
(107, 'Не зашло, ожидал большего.', '2024-03-14 22:31:39.000000', 13, 7),
(108, 'Хороший сюжет, интересные персонажи.', '2025-02-12 22:31:39.000000', 13, 10),
(109, 'Отличный фильм, всем советую!', '2024-08-22 22:31:39.000000', 13, 7),
(110, 'Сюжетная линия слабовата.', '2024-10-12 22:31:39.000000', 14, 6),
(111, 'Нудный, еле досмотрел.', '2024-11-10 22:31:39.000000', 14, 7),
(112, 'Не зашло, ожидал большего.', '2024-07-17 22:31:39.000000', 14, 5),
(113, 'Нудный, еле досмотрел.', '2024-04-01 22:31:39.000000', 14, 8),
(114, 'Фильм оставляет приятное впечатление.', '2024-04-20 22:31:39.000000', 14, 1),
(115, 'Актеры сыграли отлично.', '2024-03-21 22:31:39.000000', 14, 1),
(116, 'Фильм скучноват, ожидал большего.', '2025-02-24 22:31:39.000000', 14, 5),
(117, 'Актерская игра на высоте!', '2024-04-27 22:31:39.000000', 14, 8),
(118, 'Рекомендую к просмотру.', '2024-10-07 22:31:39.000000', 14, 10),
(119, 'Ждал большего от концовки.', '2024-07-22 22:31:39.000000', 14, 2),
(120, 'Очень атмосферный фильм.', '2024-03-13 22:31:39.000000', 15, 2),
(121, 'Рекомендую к просмотру.', '2024-12-26 22:31:39.000000', 15, 5),
(122, 'Очень атмосферный фильм.', '2024-05-13 22:31:39.000000', 15, 6),
(123, 'Нудный, еле досмотрел.', '2024-11-26 22:31:39.000000', 15, 4),
(124, 'Ждал большего от концовки.', '2024-04-28 22:31:39.000000', 15, 4),
(125, 'Не понравился финал.', '2024-08-21 22:31:39.000000', 15, 1),
(126, 'Музыка в фильме шикарная!', '2024-07-11 22:31:39.000000', 15, 6),
(127, 'Фильм оставляет приятное впечатление.', '2024-11-27 22:31:39.000000', 15, 8),
(128, 'Нудный, еле досмотрел.', '2024-09-30 22:31:39.000000', 15, 2),
(129, 'Крутые спецэффекты, но сюжет слабый.', '2025-02-13 22:31:39.000000', 15, 7),
(130, 'Музыка в фильме шикарная!', '2024-09-11 22:31:39.000000', 16, 5),
(131, 'Хороший сюжет, интересные персонажи.', '2024-09-21 22:31:39.000000', 16, 10),
(132, 'Сюжетная линия слабовата.', '2024-08-14 22:31:39.000000', 16, 8),
(133, 'Ждал большего от концовки.', '2024-07-11 22:31:39.000000', 16, 2),
(134, 'Актерская игра на высоте!', '2024-09-18 22:31:39.000000', 16, 8),
(135, 'Актеры сыграли отлично.', '2025-02-07 22:31:39.000000', 16, 1),
(136, 'Нудный, еле досмотрел.', '2024-06-10 22:31:39.000000', 16, 10),
(137, 'Сюжетная линия слабовата.', '2024-08-17 22:31:39.000000', 16, 4),
(138, 'Можно смотреть в компании.', '2024-11-23 22:31:39.000000', 16, 1),
(139, 'Сюжет непредсказуемый, круто!', '2024-07-03 22:31:39.000000', 16, 1),
(140, 'Не зашло, ожидал большего.', '2025-02-20 22:31:39.000000', 17, 1),
(141, 'Актеры сыграли отлично.', '2024-06-04 22:31:39.000000', 17, 6),
(142, 'Очень атмосферный фильм.', '2024-05-12 22:31:39.000000', 17, 1),
(143, 'Много клише, но смотреть можно.', '2024-05-24 22:31:39.000000', 17, 7),
(144, 'Актерская игра на высоте!', '2024-12-22 22:31:39.000000', 17, 2),
(145, 'Фильм оставляет приятное впечатление.', '2025-02-17 22:31:39.000000', 17, 6),
(146, 'Очень понравилось, особенно концовка!', '2024-09-24 22:31:39.000000', 17, 10),
(147, 'Сюжетная линия слабовата.', '2025-02-19 22:31:39.000000', 17, 8),
(148, 'Не зашло, ожидал большего.', '2024-06-09 22:31:39.000000', 17, 10),
(149, 'Фильм скучноват, ожидал большего.', '2024-12-31 22:31:39.000000', 17, 1),
(150, 'Фильм оставляет приятное впечатление.', '2025-01-09 22:31:39.000000', 18, 4),
(151, 'Сюжетная линия слабовата.', '2024-09-28 22:31:39.000000', 18, 10),
(152, 'Фильм скучноват, ожидал большего.', '2024-07-24 22:31:39.000000', 18, 6),
(153, 'Ждал большего от концовки.', '2024-06-12 22:31:39.000000', 18, 8),
(154, 'Сюжетная линия слабовата.', '2024-09-19 22:31:39.000000', 18, 8),
(155, 'Очень атмосферный фильм.', '2024-11-16 22:31:39.000000', 18, 7),
(156, 'Отличный фильм, всем советую!', '2024-07-22 22:31:39.000000', 18, 8),
(157, 'Отличный фильм, всем советую!', '2024-04-05 22:31:39.000000', 18, 5),
(158, 'Очень понравилось, особенно концовка!', '2024-05-24 22:31:39.000000', 18, 1),
(159, 'Крутые спецэффекты, но сюжет слабый.', '2024-04-29 22:31:39.000000', 18, 1),
(160, 'Актерская игра на высоте!', '2024-06-29 22:31:39.000000', 19, 6),
(161, 'Сюжетная линия слабовата.', '2024-05-09 22:31:39.000000', 19, 8),
(162, 'Отличный фильм, всем советую!', '2024-06-09 22:31:39.000000', 19, 2),
(163, 'Отличный фильм, всем советую!', '2024-03-15 22:31:39.000000', 19, 8),
(164, 'Сюжетная линия слабовата.', '2024-07-18 22:31:39.000000', 19, 1),
(165, 'Много клише, но смотреть можно.', '2025-01-03 22:31:39.000000', 19, 1),
(166, 'Не зашло, ожидал большего.', '2024-03-25 22:31:39.000000', 19, 7),
(167, 'Много клише, но смотреть можно.', '2024-11-15 22:31:39.000000', 19, 4),
(168, 'Актерская игра на высоте!', '2024-10-16 22:31:39.000000', 19, 6),
(169, 'Хороший сюжет, интересные персонажи.', '2024-06-20 22:31:39.000000', 19, 2),
(170, 'Хороший сюжет, интересные персонажи.', '2024-10-05 22:31:39.000000', 20, 8),
(171, 'Ждал большего от концовки.', '2024-06-24 22:31:39.000000', 20, 8),
(172, 'Ждал большего от концовки.', '2024-07-20 22:31:39.000000', 20, 2),
(173, 'Очень атмосферный фильм.', '2024-11-26 22:31:39.000000', 20, 8),
(174, 'Сюжет непредсказуемый, круто!', '2024-04-29 22:31:39.000000', 20, 10),
(175, 'Отличный фильм, всем советую!', '2024-09-27 22:31:39.000000', 20, 2),
(176, 'Нудный, еле досмотрел.', '2024-12-22 22:31:39.000000', 20, 10),
(177, 'Нудный, еле досмотрел.', '2024-04-15 22:31:39.000000', 20, 5),
(178, 'Сюжет непредсказуемый, круто!', '2024-09-06 22:31:39.000000', 20, 8),
(179, 'Не зашло, ожидал большего.', '2024-04-23 22:31:39.000000', 20, 2),
(180, 'Отличный фильм, всем советую!', '2025-02-17 22:31:39.000000', 21, 4),
(181, 'Ждал большего от концовки.', '2024-07-16 22:31:39.000000', 21, 8),
(182, 'Много клише, но смотреть можно.', '2024-10-23 22:31:39.000000', 21, 1),
(183, 'Музыка в фильме шикарная!', '2025-01-12 22:31:39.000000', 21, 5),
(184, 'Нудный, еле досмотрел.', '2024-07-10 22:31:39.000000', 21, 2),
(185, 'Не зашло, ожидал большего.', '2024-08-05 22:31:39.000000', 21, 7),
(186, 'Интересный, но пересматривать не буду.', '2024-10-08 22:31:39.000000', 21, 8),
(187, 'Нудный, еле досмотрел.', '2024-05-08 22:31:39.000000', 21, 7),
(188, 'Крутые спецэффекты, но сюжет слабый.', '2024-11-29 22:31:39.000000', 21, 10),
(189, 'Крутые спецэффекты, но сюжет слабый.', '2024-09-30 22:31:39.000000', 21, 6),
(190, 'Нудный, еле досмотрел.', '2024-05-16 22:31:39.000000', 22, 1),
(191, 'Музыка в фильме шикарная!', '2024-05-05 22:31:39.000000', 22, 2),
(192, 'Не понравился финал.', '2025-02-06 22:31:39.000000', 22, 8),
(193, 'Рекомендую к просмотру.', '2024-12-26 22:31:39.000000', 22, 7),
(194, 'Сюжет непредсказуемый, круто!', '2024-11-08 22:31:39.000000', 22, 8),
(195, 'Рекомендую к просмотру.', '2024-12-14 22:31:39.000000', 22, 2),
(196, 'Фильм скучноват, ожидал большего.', '2024-05-26 22:31:39.000000', 22, 7),
(197, 'Можно смотреть в компании.', '2024-04-11 22:31:39.000000', 22, 8),
(198, 'Хороший сюжет, интересные персонажи.', '2024-06-14 22:31:39.000000', 22, 7),
(199, 'Много клише, но смотреть можно.', '2024-06-13 22:31:39.000000', 22, 4),
(200, 'Не понравился финал.', '2024-04-27 22:31:39.000000', 23, 7),
(201, 'Фильм оставляет приятное впечатление.', '2024-12-04 22:31:39.000000', 23, 5),
(202, 'Актерская игра на высоте!', '2024-07-05 22:31:39.000000', 23, 1),
(203, 'Ждал большего от концовки.', '2024-10-22 22:31:39.000000', 23, 4),
(204, 'Сюжет непредсказуемый, круто!', '2024-07-23 22:31:39.000000', 23, 1),
(205, 'Актерская игра на высоте!', '2025-02-07 22:31:39.000000', 23, 8),
(206, 'Можно смотреть в компании.', '2024-05-17 22:31:39.000000', 23, 5),
(207, 'Отличный фильм, всем советую!', '2025-01-03 22:31:39.000000', 23, 8),
(208, 'Хороший сюжет, интересные персонажи.', '2024-10-30 22:31:39.000000', 23, 2),
(209, 'Отличный фильм, всем советую!', '2024-08-10 22:31:39.000000', 23, 1),
(210, 'Актерская игра на высоте!', '2024-05-02 22:31:39.000000', 24, 2),
(211, 'Много клише, но смотреть можно.', '2024-04-18 22:31:39.000000', 24, 6),
(212, 'Не зашло, ожидал большего.', '2024-04-02 22:31:39.000000', 24, 2),
(213, 'Фильм скучноват, ожидал большего.', '2024-04-18 22:31:39.000000', 24, 1),
(214, 'Не зашло, ожидал большего.', '2025-03-05 22:31:39.000000', 24, 4),
(215, 'Ждал большего от концовки.', '2024-06-15 22:31:39.000000', 24, 5),
(216, 'Не зашло, ожидал большего.', '2024-12-23 22:31:39.000000', 24, 10),
(217, 'Очень атмосферный фильм.', '2024-06-11 22:31:39.000000', 24, 1),
(218, 'Много клише, но смотреть можно.', '2024-04-21 22:31:39.000000', 24, 7),
(219, 'Нудный, еле досмотрел.', '2024-07-26 22:31:39.000000', 24, 5),
(220, 'Очень понравилось, особенно концовка!', '2024-12-05 22:31:39.000000', 25, 1),
(221, 'Интересный, но пересматривать не буду.', '2024-05-17 22:31:39.000000', 25, 5),
(222, 'Можно смотреть в компании.', '2024-04-08 22:31:39.000000', 25, 1),
(223, 'Можно смотреть в компании.', '2024-09-19 22:31:39.000000', 25, 6),
(224, 'Очень понравилось, особенно концовка!', '2024-11-28 22:31:39.000000', 25, 6),
(225, 'Очень атмосферный фильм.', '2024-07-22 22:31:39.000000', 25, 8),
(226, 'Нудный, еле досмотрел.', '2024-04-20 22:31:39.000000', 25, 10),
(227, 'Интересный, но пересматривать не буду.', '2024-06-09 22:31:39.000000', 25, 7),
(228, 'Очень понравилось, особенно концовка!', '2024-09-05 22:31:39.000000', 25, 7),
(229, 'Фильм оставляет приятное впечатление.', '2024-07-14 22:31:39.000000', 25, 2),
(230, 'Сюжетная линия слабовата.', '2024-06-23 22:31:39.000000', 26, 2),
(231, 'Хороший сюжет, интересные персонажи.', '2024-09-30 22:31:39.000000', 26, 7),
(232, 'Крутые спецэффекты, но сюжет слабый.', '2024-10-24 22:31:39.000000', 26, 4),
(233, 'Интересный, но пересматривать не буду.', '2024-08-01 22:31:39.000000', 26, 4),
(234, 'Крутые спецэффекты, но сюжет слабый.', '2024-06-27 22:31:39.000000', 26, 4),
(235, 'Актерская игра на высоте!', '2024-12-03 22:31:39.000000', 26, 2),
(236, 'Очень атмосферный фильм.', '2025-02-24 22:31:39.000000', 26, 8),
(237, 'Не зашло, ожидал большего.', '2024-10-01 22:31:39.000000', 26, 1),
(238, 'Актерская игра на высоте!', '2024-05-14 22:31:39.000000', 26, 8),
(239, 'Интересный, но пересматривать не буду.', '2024-09-02 22:31:39.000000', 26, 6),
(240, 'Актерская игра на высоте!', '2025-03-08 22:31:39.000000', 27, 2),
(241, 'Фильм оставляет приятное впечатление.', '2024-12-05 22:31:39.000000', 27, 4),
(242, 'Нудный, еле досмотрел.', '2025-02-10 22:31:39.000000', 27, 10),
(243, 'Интересный, но пересматривать не буду.', '2024-10-21 22:31:39.000000', 27, 7),
(244, 'Сюжет непредсказуемый, круто!', '2024-05-15 22:31:39.000000', 27, 1),
(245, 'Интересный, но пересматривать не буду.', '2024-11-24 22:31:39.000000', 27, 10),
(246, 'Фильм скучноват, ожидал большего.', '2024-12-26 22:31:39.000000', 27, 6),
(247, 'Отличный фильм, всем советую!', '2024-04-01 22:31:39.000000', 27, 8),
(248, 'Очень понравилось, особенно концовка!', '2024-05-14 22:31:39.000000', 27, 6),
(249, 'Рекомендую к просмотру.', '2024-12-30 22:31:39.000000', 27, 5),
(250, 'Фильм скучноват, ожидал большего.', '2024-04-27 22:31:39.000000', 28, 5),
(251, 'Интересный, но пересматривать не буду.', '2025-01-16 22:31:39.000000', 28, 7),
(252, 'Крутые спецэффекты, но сюжет слабый.', '2024-12-26 22:31:39.000000', 28, 7),
(253, 'Актерская игра на высоте!', '2024-12-01 22:31:39.000000', 28, 5),
(254, 'Сюжетная линия слабовата.', '2025-02-24 22:31:39.000000', 28, 7),
(255, 'Хороший сюжет, интересные персонажи.', '2025-02-22 22:31:39.000000', 28, 4),
(256, 'Не понравился финал.', '2024-04-12 22:31:39.000000', 28, 8),
(257, 'Фильм скучноват, ожидал большего.', '2024-04-27 22:31:39.000000', 28, 2),
(258, 'Интересный, но пересматривать не буду.', '2024-03-29 22:31:39.000000', 28, 1),
(259, 'Отличный фильм, всем советую!', '2024-12-22 22:31:39.000000', 28, 2),
(260, 'Крутые спецэффекты, но сюжет слабый.', '2024-07-03 22:31:39.000000', 29, 7),
(261, 'Рекомендую к просмотру.', '2024-12-14 22:31:39.000000', 29, 4),
(262, 'Хороший сюжет, интересные персонажи.', '2024-09-15 22:31:39.000000', 29, 5),
(263, 'Интересный, но пересматривать не буду.', '2025-02-09 22:31:39.000000', 29, 7),
(264, 'Крутые спецэффекты, но сюжет слабый.', '2024-12-07 22:31:39.000000', 29, 10),
(265, 'Отличный фильм, всем советую!', '2024-09-24 22:31:39.000000', 29, 5),
(266, 'Нудный, еле досмотрел.', '2024-06-26 22:31:39.000000', 29, 6),
(267, 'Нудный, еле досмотрел.', '2024-11-28 22:31:39.000000', 29, 1),
(268, 'Музыка в фильме шикарная!', '2025-02-15 22:31:39.000000', 29, 8),
(269, 'Хороший сюжет, интересные персонажи.', '2024-11-02 22:31:39.000000', 29, 10),
(270, 'Можно смотреть в компании.', '2024-12-05 22:31:39.000000', 30, 6),
(271, 'Интересный, но пересматривать не буду.', '2024-08-04 22:31:39.000000', 30, 6),
(272, 'Не понравился финал.', '2024-06-05 22:31:39.000000', 30, 5),
(273, 'Очень атмосферный фильм.', '2024-10-18 22:31:39.000000', 30, 8),
(274, 'Хороший сюжет, интересные персонажи.', '2025-01-10 22:31:39.000000', 30, 1),
(275, 'Рекомендую к просмотру.', '2025-01-20 22:31:39.000000', 30, 4),
(276, 'Ждал большего от концовки.', '2024-09-28 22:31:39.000000', 30, 4),
(277, 'Отличный фильм, всем советую!', '2024-11-17 22:31:39.000000', 30, 7),
(278, 'Много клише, но смотреть можно.', '2024-06-03 22:31:39.000000', 30, 6),
(279, 'Отличный фильм, всем советую!', '2024-05-21 22:31:39.000000', 30, 2),
(280, 'Ждал большего от концовки.', '2025-01-27 22:31:39.000000', 31, 1),
(281, 'Можно смотреть в компании.', '2024-05-02 22:31:39.000000', 31, 8),
(282, 'Рекомендую к просмотру.', '2024-07-07 22:31:39.000000', 31, 1),
(283, 'Нудный, еле досмотрел.', '2024-07-19 22:31:39.000000', 31, 7),
(284, 'Можно смотреть в компании.', '2024-09-10 22:31:39.000000', 31, 6),
(285, 'Ждал большего от концовки.', '2024-08-08 22:31:39.000000', 31, 6),
(286, 'Не зашло, ожидал большего.', '2025-02-21 22:31:39.000000', 31, 2),
(287, 'Сюжет непредсказуемый, круто!', '2024-12-04 22:31:39.000000', 31, 7),
(288, 'Не зашло, ожидал большего.', '2024-10-18 22:31:39.000000', 31, 10),
(289, 'Интересный, но пересматривать не буду.', '2024-10-12 22:31:39.000000', 31, 5),
(290, 'Нудный, еле досмотрел.', '2024-08-21 22:31:39.000000', 32, 7),
(291, 'Ждал большего от концовки.', '2025-01-13 22:31:39.000000', 32, 2),
(292, 'Можно смотреть в компании.', '2025-02-09 22:31:39.000000', 32, 5),
(293, 'Не зашло, ожидал большего.', '2024-09-23 22:31:39.000000', 32, 4),
(294, 'Нудный, еле досмотрел.', '2024-08-26 22:31:39.000000', 32, 10),
(295, 'Не понравился финал.', '2024-12-11 22:31:39.000000', 32, 7),
(296, 'Музыка в фильме шикарная!', '2024-04-07 22:31:39.000000', 32, 2),
(297, 'Рекомендую к просмотру.', '2024-09-03 22:31:39.000000', 32, 7),
(298, 'Не понравился финал.', '2024-12-10 22:31:39.000000', 32, 8),
(299, 'Сюжет непредсказуемый, круто!', '2024-08-29 22:31:39.000000', 32, 5),
(300, 'Крутые спецэффекты, но сюжет слабый.', '2025-02-13 22:31:39.000000', 33, 1),
(301, 'Много клише, но смотреть можно.', '2024-07-06 22:31:39.000000', 33, 8),
(302, 'Сюжетная линия слабовата.', '2024-06-02 22:31:39.000000', 33, 10),
(303, 'Отличный фильм, всем советую!', '2024-10-13 22:31:39.000000', 33, 1),
(304, 'Можно смотреть в компании.', '2024-12-26 22:31:39.000000', 33, 10),
(305, 'Можно смотреть в компании.', '2024-04-17 22:31:39.000000', 33, 6),
(306, 'Интересный, но пересматривать не буду.', '2024-10-17 22:31:39.000000', 33, 4),
(307, 'Сюжет непредсказуемый, круто!', '2024-08-27 22:31:39.000000', 33, 6),
(308, 'Сюжетная линия слабовата.', '2024-10-08 22:31:39.000000', 33, 1),
(309, 'Не понравился финал.', '2024-03-15 22:31:39.000000', 33, 7),
(310, 'Хороший сюжет, интересные персонажи.', '2024-12-18 22:31:39.000000', 34, 4),
(311, 'Можно смотреть в компании.', '2024-07-25 22:31:39.000000', 34, 4),
(312, 'Отличный фильм, всем советую!', '2025-02-02 22:31:39.000000', 34, 1),
(313, 'Много клише, но смотреть можно.', '2024-11-23 22:31:39.000000', 34, 8),
(314, 'Ждал большего от концовки.', '2024-06-29 22:31:39.000000', 34, 10),
(315, 'Хороший сюжет, интересные персонажи.', '2024-08-29 22:31:39.000000', 34, 10),
(316, 'Не зашло, ожидал большего.', '2025-01-03 22:31:39.000000', 34, 5),
(317, 'Можно смотреть в компании.', '2024-10-18 22:31:39.000000', 34, 10),
(318, 'Ждал большего от концовки.', '2024-05-06 22:31:39.000000', 34, 5),
(319, 'Фильм скучноват, ожидал большего.', '2025-02-28 22:31:39.000000', 34, 5),
(320, 'Сюжет непредсказуемый, круто!', '2024-04-17 22:31:39.000000', 35, 8),
(321, 'Актерская игра на высоте!', '2024-03-25 22:31:39.000000', 35, 4),
(322, 'Очень понравилось, особенно концовка!', '2024-10-08 22:31:39.000000', 35, 8),
(323, 'Рекомендую к просмотру.', '2024-06-24 22:31:39.000000', 35, 5),
(324, 'Фильм скучноват, ожидал большего.', '2024-04-19 22:31:39.000000', 35, 8),
(325, 'Хороший сюжет, интересные персонажи.', '2024-07-29 22:31:39.000000', 35, 8),
(326, 'Нудный, еле досмотрел.', '2024-04-05 22:31:39.000000', 35, 8),
(327, 'Ждал большего от концовки.', '2024-07-10 22:31:39.000000', 35, 6),
(328, 'Крутые спецэффекты, но сюжет слабый.', '2024-06-14 22:31:39.000000', 35, 7),
(329, 'Интересный, но пересматривать не буду.', '2024-09-07 22:31:39.000000', 35, 10),
(330, 'Не зашло, ожидал большего.', '2024-05-03 22:31:39.000000', 36, 5),
(331, 'Сюжет непредсказуемый, круто!', '2024-09-11 22:31:39.000000', 36, 8),
(332, 'Можно смотреть в компании.', '2024-11-22 22:31:39.000000', 36, 2),
(333, 'Отличный фильм, всем советую!', '2025-01-27 22:31:39.000000', 36, 8),
(334, 'Нудный, еле досмотрел.', '2025-02-18 22:31:39.000000', 36, 7),
(335, 'Не зашло, ожидал большего.', '2024-08-15 22:31:39.000000', 36, 1),
(336, 'Крутые спецэффекты, но сюжет слабый.', '2025-01-06 22:31:39.000000', 36, 6),
(337, 'Рекомендую к просмотру.', '2024-09-17 22:31:39.000000', 36, 5),
(338, 'Фильм скучноват, ожидал большего.', '2024-11-14 22:31:39.000000', 36, 2),
(339, 'Актерская игра на высоте!', '2025-01-30 22:31:39.000000', 36, 1),
(340, 'Интересный, но пересматривать не буду.', '2024-06-17 22:31:39.000000', 37, 4),
(341, 'Сюжетная линия слабовата.', '2024-06-04 22:31:39.000000', 37, 8),
(342, 'Фильм оставляет приятное впечатление.', '2024-12-10 22:31:39.000000', 37, 1),
(343, 'Актеры сыграли отлично.', '2024-04-22 22:31:39.000000', 37, 8),
(344, 'Фильм скучноват, ожидал большего.', '2024-08-04 22:31:39.000000', 37, 4),
(345, 'Нудный, еле досмотрел.', '2024-09-17 22:31:39.000000', 37, 4),
(346, 'Много клише, но смотреть можно.', '2025-02-02 22:31:39.000000', 37, 6),
(347, 'Рекомендую к просмотру.', '2025-02-16 22:31:39.000000', 37, 8),
(348, 'Очень атмосферный фильм.', '2024-09-14 22:31:39.000000', 37, 1),
(349, 'Ждал большего от концовки.', '2025-02-09 22:31:39.000000', 37, 5),
(350, 'Актеры сыграли отлично.', '2024-11-30 22:31:39.000000', 38, 8),
(351, 'Актеры сыграли отлично.', '2024-04-24 22:31:39.000000', 38, 2),
(352, 'Фильм оставляет приятное впечатление.', '2024-06-01 22:31:39.000000', 38, 10),
(353, 'Отличный фильм, всем советую!', '2024-03-23 22:31:39.000000', 38, 2),
(354, 'Очень атмосферный фильм.', '2024-09-21 22:31:39.000000', 38, 8),
(355, 'Нудный, еле досмотрел.', '2025-02-04 22:31:39.000000', 38, 5),
(356, 'Рекомендую к просмотру.', '2025-01-13 22:31:39.000000', 38, 2),
(357, 'Хороший сюжет, интересные персонажи.', '2024-07-27 22:31:39.000000', 38, 6),
(358, 'Ждал большего от концовки.', '2024-09-24 22:31:39.000000', 38, 10),
(359, 'Актеры сыграли отлично.', '2024-07-08 22:31:39.000000', 38, 2),
(360, 'Очень атмосферный фильм.', '2024-09-18 22:31:39.000000', 39, 6),
(361, 'Много клише, но смотреть можно.', '2024-07-10 22:31:39.000000', 39, 6),
(362, 'Много клише, но смотреть можно.', '2024-08-01 22:31:39.000000', 39, 2),
(363, 'Актерская игра на высоте!', '2024-06-15 22:31:39.000000', 39, 1),
(364, 'Актеры сыграли отлично.', '2025-02-24 22:31:39.000000', 39, 6),
(365, 'Фильм оставляет приятное впечатление.', '2024-08-12 22:31:39.000000', 39, 8),
(366, 'Актеры сыграли отлично.', '2024-11-11 22:31:39.000000', 39, 6),
(367, 'Очень понравилось, особенно концовка!', '2024-04-05 22:31:39.000000', 39, 5),
(368, 'Очень атмосферный фильм.', '2024-07-23 22:31:39.000000', 39, 2),
(369, 'Актеры сыграли отлично.', '2024-07-03 22:31:39.000000', 39, 1),
(370, 'Хороший сюжет, интересные персонажи.', '2024-09-30 22:31:39.000000', 40, 8),
(371, 'Рекомендую к просмотру.', '2024-03-10 22:31:39.000000', 40, 1),
(372, 'Много клише, но смотреть можно.', '2024-07-06 22:31:39.000000', 40, 8),
(373, 'Фильм скучноват, ожидал большего.', '2024-11-02 22:31:39.000000', 40, 10),
(374, 'Интересный, но пересматривать не буду.', '2024-04-22 22:31:39.000000', 40, 6),
(375, 'Не понравился финал.', '2024-09-13 22:31:39.000000', 40, 2),
(376, 'Фильм скучноват, ожидал большего.', '2024-09-04 22:31:39.000000', 40, 6),
(377, 'Актеры сыграли отлично.', '2024-03-19 22:31:39.000000', 40, 5),
(378, 'Фильм оставляет приятное впечатление.', '2024-03-26 22:31:39.000000', 40, 2),
(379, 'Фильм скучноват, ожидал большего.', '2024-08-09 22:31:39.000000', 40, 2),
(380, 'Не понравился финал.', '2024-10-15 22:31:39.000000', 41, 6),
(381, 'Актеры сыграли отлично.', '2024-10-17 22:31:39.000000', 41, 10),
(382, 'Рекомендую к просмотру.', '2024-04-22 22:31:39.000000', 41, 1),
(383, 'Отличный фильм, всем советую!', '2024-09-18 22:31:39.000000', 41, 7),
(384, 'Интересный, но пересматривать не буду.', '2025-01-06 22:31:39.000000', 41, 8),
(385, 'Актерская игра на высоте!', '2024-04-26 22:31:39.000000', 41, 10),
(386, 'Нудный, еле досмотрел.', '2024-06-01 22:31:39.000000', 41, 1),
(387, 'Отличный фильм, всем советую!', '2024-11-10 22:31:39.000000', 41, 8),
(388, 'Много клише, но смотреть можно.', '2024-10-04 22:31:39.000000', 41, 1),
(389, 'Очень атмосферный фильм.', '2024-03-25 22:31:39.000000', 41, 10),
(390, 'Музыка в фильме шикарная!', '2024-11-27 22:31:39.000000', 42, 6),
(391, 'Много клише, но смотреть можно.', '2025-01-31 22:31:39.000000', 42, 6),
(392, 'Можно смотреть в компании.', '2024-06-23 22:31:39.000000', 42, 5),
(393, 'Актеры сыграли отлично.', '2024-09-19 22:31:39.000000', 42, 1),
(394, 'Можно смотреть в компании.', '2024-09-30 22:31:39.000000', 42, 8),
(395, 'Рекомендую к просмотру.', '2024-11-15 22:31:39.000000', 42, 1),
(396, 'Можно смотреть в компании.', '2024-07-22 22:31:39.000000', 42, 10),
(397, 'Сюжетная линия слабовата.', '2025-02-27 22:31:39.000000', 42, 7),
(398, 'Музыка в фильме шикарная!', '2024-08-01 22:31:39.000000', 42, 8),
(399, 'Рекомендую к просмотру.', '2025-03-08 22:31:39.000000', 42, 8),
(400, 'Хороший сюжет, интересные персонажи.', '2024-11-30 22:31:39.000000', 43, 10),
(401, 'Фильм скучноват, ожидал большего.', '2024-09-04 22:31:39.000000', 43, 8),
(402, 'Сюжет непредсказуемый, круто!', '2024-07-07 22:31:39.000000', 43, 4),
(403, 'Нудный, еле досмотрел.', '2024-10-02 22:31:39.000000', 43, 7),
(404, 'Интересный, но пересматривать не буду.', '2024-09-20 22:31:39.000000', 43, 2),
(405, 'Не понравился финал.', '2024-10-28 22:31:39.000000', 43, 8),
(406, 'Рекомендую к просмотру.', '2024-10-17 22:31:39.000000', 43, 5),
(407, 'Сюжет непредсказуемый, круто!', '2025-03-05 22:31:39.000000', 43, 6),
(408, 'Не зашло, ожидал большего.', '2024-03-22 22:31:39.000000', 43, 10),
(409, 'Актеры сыграли отлично.', '2024-06-24 22:31:39.000000', 43, 8),
(410, 'Можно смотреть в компании.', '2025-01-22 22:31:39.000000', 44, 2),
(411, 'Рекомендую к просмотру.', '2024-05-01 22:31:39.000000', 44, 10),
(412, 'Интересный, но пересматривать не буду.', '2024-11-09 22:31:39.000000', 44, 2),
(413, 'Много клише, но смотреть можно.', '2024-05-16 22:31:39.000000', 44, 1),
(414, 'Нудный, еле досмотрел.', '2024-07-08 22:31:39.000000', 44, 4),
(415, 'Фильм скучноват, ожидал большего.', '2024-11-22 22:31:39.000000', 44, 2),
(416, 'Нудный, еле досмотрел.', '2024-05-09 22:31:39.000000', 44, 7),
(417, 'Много клише, но смотреть можно.', '2024-06-30 22:31:39.000000', 44, 10),
(418, 'Нудный, еле досмотрел.', '2024-11-28 22:31:39.000000', 44, 8),
(419, 'Крутые спецэффекты, но сюжет слабый.', '2024-11-30 22:31:39.000000', 44, 8),
(420, 'Актерская игра на высоте!', '2024-10-01 22:31:39.000000', 45, 4),
(421, 'Крутые спецэффекты, но сюжет слабый.', '2024-12-29 22:31:39.000000', 45, 1),
(422, 'Сюжет непредсказуемый, круто!', '2024-03-21 22:31:39.000000', 45, 4),
(423, 'Очень атмосферный фильм.', '2024-09-06 22:31:39.000000', 45, 4),
(424, 'Фильм скучноват, ожидал большего.', '2025-02-21 22:31:39.000000', 45, 4),
(425, 'Много клише, но смотреть можно.', '2024-10-27 22:31:39.000000', 45, 5),
(426, 'Не зашло, ожидал большего.', '2025-01-30 22:31:39.000000', 45, 1),
(427, 'Много клише, но смотреть можно.', '2024-09-17 22:31:39.000000', 45, 2),
(428, 'Хороший сюжет, интересные персонажи.', '2024-12-11 22:31:39.000000', 45, 6),
(429, 'Ждал большего от концовки.', '2024-03-29 22:31:39.000000', 45, 1),
(430, 'Очень атмосферный фильм.', '2024-10-23 22:31:39.000000', 46, 7),
(431, 'Много клише, но смотреть можно.', '2025-01-28 22:31:39.000000', 46, 4),
(432, 'Не зашло, ожидал большего.', '2024-11-03 22:31:39.000000', 46, 1),
(433, 'Актеры сыграли отлично.', '2024-08-18 22:31:39.000000', 46, 6),
(434, 'Сюжет непредсказуемый, круто!', '2024-05-17 22:31:39.000000', 46, 7),
(435, 'Ждал большего от концовки.', '2024-03-17 22:31:39.000000', 46, 7),
(436, 'Можно смотреть в компании.', '2025-02-05 22:31:39.000000', 46, 8),
(437, 'Сюжет непредсказуемый, круто!', '2024-04-06 22:31:39.000000', 46, 6),
(438, 'Рекомендую к просмотру.', '2024-08-10 22:31:39.000000', 46, 2),
(439, 'Рекомендую к просмотру.', '2024-07-22 22:31:39.000000', 46, 10),
(440, 'Ждал большего от концовки.', '2025-02-17 22:31:39.000000', 47, 7),
(441, 'Сюжетная линия слабовата.', '2025-02-26 22:31:39.000000', 47, 5),
(442, 'Актеры сыграли отлично.', '2024-04-20 22:31:39.000000', 47, 7),
(443, 'Актеры сыграли отлично.', '2025-01-08 22:31:39.000000', 47, 7),
(444, 'Очень атмосферный фильм.', '2024-03-24 22:31:39.000000', 47, 1),
(445, 'Интересный, но пересматривать не буду.', '2025-01-05 22:31:39.000000', 47, 6),
(446, 'Очень понравилось, особенно концовка!', '2024-09-29 22:31:39.000000', 47, 6),
(447, 'Очень атмосферный фильм.', '2025-03-05 22:31:39.000000', 47, 7),
(448, 'Хороший сюжет, интересные персонажи.', '2024-03-19 22:31:39.000000', 47, 1),
(449, 'Актерская игра на высоте!', '2024-09-20 22:31:39.000000', 47, 7),
(450, 'Музыка в фильме шикарная!', '2024-09-15 22:31:39.000000', 48, 6),
(451, 'Рекомендую к просмотру.', '2025-02-12 22:31:39.000000', 48, 6),
(452, 'Сюжетная линия слабовата.', '2024-09-08 22:31:39.000000', 48, 2),
(453, 'Музыка в фильме шикарная!', '2024-07-24 22:31:39.000000', 48, 2),
(454, 'Музыка в фильме шикарная!', '2024-09-02 22:31:39.000000', 48, 4),
(455, 'Фильм оставляет приятное впечатление.', '2024-06-22 22:31:39.000000', 48, 5),
(456, 'Отличный фильм, всем советую!', '2025-01-12 22:31:39.000000', 48, 7),
(457, 'Нудный, еле досмотрел.', '2024-04-25 22:31:39.000000', 48, 5),
(458, 'Фильм оставляет приятное впечатление.', '2024-04-16 22:31:39.000000', 48, 2),
(459, 'Сюжет непредсказуемый, круто!', '2025-03-03 22:31:39.000000', 48, 4),
(460, 'Очень атмосферный фильм.', '2024-05-19 22:31:39.000000', 49, 10),
(461, 'Ждал большего от концовки.', '2024-04-26 22:31:39.000000', 49, 5),
(462, 'Очень атмосферный фильм.', '2024-05-03 22:31:39.000000', 49, 10),
(463, 'Нудный, еле досмотрел.', '2024-04-05 22:31:39.000000', 49, 7),
(464, 'Не понравился финал.', '2024-10-18 22:31:39.000000', 49, 8),
(465, 'Очень атмосферный фильм.', '2024-10-14 22:31:39.000000', 49, 2),
(466, 'Не понравился финал.', '2024-08-08 22:31:39.000000', 49, 1),
(467, 'Много клише, но смотреть можно.', '2024-09-10 22:31:39.000000', 49, 2),
(468, 'Ждал большего от концовки.', '2024-06-18 22:31:39.000000', 49, 8),
(469, 'Очень атмосферный фильм.', '2024-10-22 22:31:39.000000', 49, 5),
(470, 'Очень атмосферный фильм.', '2024-03-10 22:31:39.000000', 50, 2),
(471, 'Интересный, но пересматривать не буду.', '2025-01-04 22:31:39.000000', 50, 6),
(472, 'Актеры сыграли отлично.', '2024-09-17 22:31:39.000000', 50, 2),
(473, 'Не понравился финал.', '2024-08-12 22:31:39.000000', 50, 2),
(474, 'Музыка в фильме шикарная!', '2024-11-09 22:31:39.000000', 50, 5),
(475, 'Рекомендую к просмотру.', '2025-02-04 22:31:39.000000', 50, 4),
(476, 'Очень понравилось, особенно концовка!', '2025-01-02 22:31:39.000000', 50, 4),
(477, 'Фильм скучноват, ожидал большего.', '2024-09-06 22:31:39.000000', 50, 2),
(478, 'Отличный фильм, всем советую!', '2024-04-21 22:31:39.000000', 50, 8),
(479, 'Нудный, еле досмотрел.', '2024-04-29 22:31:39.000000', 50, 2),
(480, 'Не зашло, ожидал большего.', '2024-09-26 22:31:39.000000', 51, 5),
(481, 'Фильм оставляет приятное впечатление.', '2024-08-18 22:31:39.000000', 51, 1),
(482, 'Сюжет непредсказуемый, круто!', '2024-08-30 22:31:39.000000', 51, 4),
(483, 'Сюжет непредсказуемый, круто!', '2024-10-26 22:31:39.000000', 51, 6),
(484, 'Музыка в фильме шикарная!', '2024-12-28 22:31:39.000000', 51, 6),
(485, 'Сюжет непредсказуемый, круто!', '2024-08-30 22:31:39.000000', 51, 6),
(486, 'Можно смотреть в компании.', '2024-07-21 22:31:39.000000', 51, 5),
(487, 'Актерская игра на высоте!', '2024-11-10 22:31:39.000000', 51, 10),
(488, 'Сюжет непредсказуемый, круто!', '2024-12-11 22:31:39.000000', 51, 4),
(489, 'Сюжет непредсказуемый, круто!', '2025-03-05 22:31:39.000000', 51, 4),
(490, 'Можно смотреть в компании.', '2024-09-02 22:31:39.000000', 52, 2),
(491, 'Музыка в фильме шикарная!', '2024-03-11 22:31:39.000000', 52, 1),
(492, 'Крутые спецэффекты, но сюжет слабый.', '2024-05-09 22:31:39.000000', 52, 10),
(493, 'Очень атмосферный фильм.', '2024-05-03 22:31:39.000000', 52, 8),
(494, 'Хороший сюжет, интересные персонажи.', '2024-07-07 22:31:39.000000', 52, 2),
(495, 'Актерская игра на высоте!', '2024-05-29 22:31:39.000000', 52, 10),
(496, 'Можно смотреть в компании.', '2024-11-23 22:31:39.000000', 52, 2),
(497, 'Крутые спецэффекты, но сюжет слабый.', '2025-01-07 22:31:39.000000', 52, 8),
(498, 'Интересный, но пересматривать не буду.', '2024-06-13 22:31:39.000000', 52, 2),
(499, 'Актеры сыграли отлично.', '2024-11-22 22:31:39.000000', 52, 4),
(500, 'Фильм оставляет приятное впечатление.', '2025-02-13 22:31:39.000000', 53, 2),
(501, 'Фильм скучноват, ожидал большего.', '2024-08-04 22:31:39.000000', 53, 10),
(502, 'Не зашло, ожидал большего.', '2024-04-25 22:31:39.000000', 53, 5),
(503, 'Сюжет непредсказуемый, круто!', '2024-10-05 22:31:39.000000', 53, 2),
(504, 'Ждал большего от концовки.', '2024-12-07 22:31:39.000000', 53, 7),
(505, 'Актерская игра на высоте!', '2024-08-21 22:31:39.000000', 53, 4),
(506, 'Фильм скучноват, ожидал большего.', '2024-08-28 22:31:39.000000', 53, 1),
(507, 'Фильм оставляет приятное впечатление.', '2025-02-26 22:31:39.000000', 53, 8),
(508, 'Музыка в фильме шикарная!', '2025-01-25 22:31:39.000000', 53, 1),
(509, 'Очень атмосферный фильм.', '2024-10-30 22:31:39.000000', 53, 2),
(511, 'дада.', '2025-05-12 22:40:59.534191', 5, 10),
(512, '!!!', '2025-05-13 14:33:32.664851', 11, 10),
(513, 'Даа...', '2025-05-13 18:59:52.082656', 5, 10),
(516, 'Согласен с Эдемом!!!', '2025-05-18 17:09:13.045966', 4, 18);

-- --------------------------------------------------------

--
-- Структура таблицы `core_film`
--

CREATE TABLE `core_film` (
  `id` bigint NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` longtext NOT NULL,
  `release_date` date NOT NULL,
  `duration` int NOT NULL,
  `image` varchar(100) DEFAULT NULL,
  `video` varchar(100) DEFAULT NULL,
  `video_path_encrypted` longblob
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_film`
--

INSERT INTO `core_film` (`id`, `title`, `description`, `release_date`, `duration`, `image`, `video`, `video_path_encrypted`) VALUES
(4, 'Интерстеллар', 'Фантастический эпос о путешествии через червоточину в поисках нового дома для человечества.', '2014-11-06', 169, 'films/258955.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(5, 'Начало', 'Фильм о проникновении в сны и манипуляции сознанием.', '2010-07-16', 148, 'films/6d34b08f02ee473298b136d0c522_sUuiCnE.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(6, 'Матрица', 'Хакер Нео узнает, что его мир — это симуляция, созданная машинами.', '1999-03-31', 136, 'films/orig.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(7, 'Властелин колец: Братство кольца', 'Фродо и его друзья отправляются в опасное путешествие, чтобы уничтожить Кольцо Всевластия.', '2001-12-19', 178, 'films/orig_1.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(8, 'Крестный отец', 'Эпическая история о сицилийской мафиозной семье Корлеоне.', '1972-03-24', 175, 'films/10370-1000x830.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(9, 'Темный рыцарь', 'Бэтмен сражается с хаосом, который сеет Джокер в Готэме.', '2008-07-18', 152, 'films/Тёмный_рыцарь_2008_постер.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(10, 'Побег из Шоушенка', 'История о надежде и дружбе в тюрьме Шоушенк.', '1994-09-23', 142, 'films/Movie_poster_the_shawshank_redemption.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(11, 'Форрест Гамп', 'Жизнь человека с низким IQ, который становится свидетелем ключевых событий истории США.', '1994-07-06', 142, 'films/p15829_v_v13_aa.jpeg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(12, 'Звездные войны: Эпизод IV – Новая надежда', 'Люк Скайуокер присоединяется к повстанцам, чтобы сразиться с Империей.', '1977-05-25', 121, 'films/orig_2.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(13, 'Терминатор 2: Судный день', 'Робот-терминатор защищает молодого Джона Коннора от более совершенного киборга.', '1991-07-03', 137, 'films/w1500_37671851.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(14, 'Чужой', 'Экипаж космического корабля сталкивается с смертоносным инопланетным существом.', '1979-05-25', 117, 'films/3F3F3F3F3F-3F3F3F.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(15, 'Титаник', 'История любви на фоне крушения легендарного корабля.', '1997-12-19', 195, 'films/576x.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(16, 'Гладиатор', 'Генерал Максимус становится гладиатором, чтобы отомстить за свою семью.', '2000-05-05', 155, 'films/orig_3.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(17, 'Бойцовский клуб', 'Мужчина создает подпольный бойцовский клуб как форму протеста против общества.', '1999-10-15', 139, 'films/orig_4.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(18, 'Пираты Карибского моря: Проклятие Черной жемчужины', 'Капитан Джек Воробей ищет свой корабль, Черную жемчужину.', '2003-07-09', 143, 'films/orig_5.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(19, 'Гарри Поттер и философский камень', 'Мальчик-волшебник узнает о своей магической природе и поступает в Хогвартс.', '2001-11-16', 152, 'films/images.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(20, 'Аватар', 'Человек становится частью инопланетной расы на планете Пандора.', '2009-12-18', 162, 'films/orig_6.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(21, 'Джокер', 'История становления одного из самых известных злодеев комиксов.', '2019-10-04', 122, 'films/orig_7.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(22, 'Мстители: Финал', 'Супергерои объединяются, чтобы остановить Таноса и восстановить вселенную.', '2019-04-26', 181, 'films/567177.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(23, 'Однажды в Голливуде', 'История актера и его дублера на фоне изменений в киноиндустрии 1960-х.', '2019-07-26', 161, 'films/onceuponatimeinhollywood_21.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(24, 'Дюнкерк', 'Эвакуация союзных войск из Дюнкерка во время Второй мировой войны.', '2017-07-21', 106, 'films/Dunkirk_film_2017.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(25, 'Джанго освобожденный', 'Освобожденный раб ищет свою жену в довоенной Америке.', '2012-12-25', 165, 'films/130624.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(26, 'Остров проклятых', 'Два маршала США расследуют исчезновение пациентки из психиатрической больницы.', '2010-02-19', 138, 'films/images_1.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(27, 'Индиана Джонс: В поисках утраченного ковчега', 'Археолог Индиана Джонс ищет библейский Ковчег Завета.', '1981-06-12', 115, 'films/76497.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(28, 'Криминальное чтиво', 'Переплетающиеся истории гангстеров, боксеров и бандитов.', '1994-10-14', 154, 'films/10583-1000x830.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(29, 'Шрек', 'Огр Шрек отправляется в путешествие, чтобы спасти принцессу.', '2001-05-18', 90, 'films/orig_8.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(30, 'Король Лев', 'Молодой львенок Симба борется за свое место в кругу жизни.', '1994-06-24', 88, 'films/100459.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(31, 'Человек-паук: Через вселенные', 'Майлз Моралес становится новым Человеком-пауком в мультивселенной.', '2018-12-14', 117, 'films/8f56c2_FkZKITxVQAAnGSf.jpeg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(32, 'Валл-И', 'Робот-уборщик влюбляется и отправляется в космическое приключение.', '2008-06-27', 98, 'films/walle_19.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(33, 'Тайна Коко', 'Мальчик отправляется в мир мертвых, чтобы раскрыть семейную тайну.', '2017-11-22', 105, 'films/orig_9.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(34, 'Гравитация', 'Астронавты борются за выживание после разрушения их космического корабля.', '2013-10-04', 91, 'films/Gravity_poster.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(35, 'Мадагаскар', 'Группа животных из зоопарка оказывается на острове Мадагаскар.', '2005-05-27', 86, 'films/576x_1.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(36, 'Люди Икс: Дни минувшего будущего', 'Мутанты пытаются предотвратить апокалипсис, изменив прошлое.', '2014-05-23', 132, 'films/X-Men_Days_of_Future_Past.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(37, 'Дэдпул', 'Наемник с чувством юмора становится супергероем.', '2016-02-12', 108, 'films/orig_10.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(38, 'Оно', 'Группа детей сталкивается с древним злом в маленьком городке.', '2017-09-08', 135, 'films/1920x.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(39, 'Сияние', 'Писатель и его семья сталкиваются с паранормальными явлениями в отеле.', '1980-05-23', 146, 'films/orig_11.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(40, 'Пианист', 'История польского пианиста, пережившего Холокост.', '2002-09-06', 150, 'films/cover1_w600_3.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(41, 'Список Шиндлера', 'История Оскара Шиндлера, спасшего тысячи евреев во время Холокоста.', '1993-12-15', 195, 'films/orig_12.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(42, 'Хатико: Самый верный друг', 'История о преданности собаки своему хозяину.', '2009-03-12', 93, 'films/417719.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(43, 'Достучаться до небес', 'Двое мужчин сбегают из больницы и отправляются в путешествие.', '1997-02-20', 87, 'films/576x_2.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(44, 'Леон', 'Профессиональный убийца берет под опеку девочку-сироту.', '1994-09-14', 110, 'films/576x_3.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(45, 'Большой куш', 'История о подпольном мире лондонских грабителей.', '2000-09-01', 104, 'films/Snatch_Movie_Poster.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(46, 'Игра престолов', 'Эпическая сага о борьбе за власть в вымышленном мире.', '2011-04-17', 57, 'films/9e277c04a0c94e85ba9adb59d738.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(47, 'Шерлок Холмс', 'Детектив Шерлок Холмс расследует загадочные преступления.', '2009-12-25', 128, 'films/sherlockholmes_2.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(48, 'Дракула', 'История о вампире Дракуле и его роковой любви.', '1992-11-13', 128, 'films/orig_13.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(49, 'Малхолланд Драйв', 'Загадочная история о женщине, потерявшей память.', '2001-05-16', 147, 'films/208275.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(50, 'Бегущий по лезвию', 'Детектив охотится за репликантами в будущем Лос-Анджелесе.', '1982-06-25', 117, 'films/88656.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(51, 'Трон: Наследие', 'Сын программиста попадает в виртуальный мир, созданный его отцом.', '2010-12-17', 125, 'films/17884.jpg', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(52, 'Малышка на миллион', 'История о боксере, который борется за свою мечту.', '2004-12-15', 132, 'films/600x900.png', 'films/videos/Interstellar Movie - Official Trailer.mp4', NULL),
(53, 'Гран Торино', 'Ветеран войны защищает своего соседа от банды.', '2008-12-12', 116, 'films/l1048753918.jpg', 'films/videos/Interstellar_Movie_-_Official_Trailer.mp4', 0x674141414141426f496b496342564c4a795a324b52647576546b5f4c6b524e677a4b7871514c4a50675f35516f4f74636162575658596d5958646c5f38385168773257367931673959504e353562594e33526b596951676f4d613835485859674f574c456a3866314473342d4547786f4d57676b4b4d6b7a3172613659666758726e64733935674143643666);

-- --------------------------------------------------------

--
-- Структура таблицы `core_filmgenre`
--

CREATE TABLE `core_filmgenre` (
  `id` bigint NOT NULL,
  `film_id` bigint NOT NULL,
  `genre_id` bigint NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_filmgenre`
--

INSERT INTO `core_filmgenre` (`id`, `film_id`, `genre_id`) VALUES
(2, 4, 5),
(3, 4, 2),
(4, 4, 10),
(5, 5, 5),
(6, 5, 8),
(7, 5, 10),
(8, 6, 5),
(9, 6, 4),
(10, 6, 8),
(11, 7, 17),
(12, 7, 10),
(13, 7, 2),
(14, 8, 2),
(15, 8, 16),
(16, 9, 4),
(17, 9, 8),
(18, 9, 16),
(19, 10, 2),
(20, 11, 2),
(21, 11, 1),
(22, 12, 5),
(23, 12, 10),
(24, 13, 5),
(25, 13, 4),
(26, 14, 5),
(27, 14, 6),
(28, 15, 2),
(29, 15, 7),
(30, 16, 12),
(31, 16, 4),
(32, 16, 2),
(33, 17, 2),
(34, 17, 8),
(35, 18, 10),
(36, 18, 1),
(37, 19, 17),
(38, 19, 10),
(39, 20, 5),
(40, 20, 10),
(41, 21, 2),
(42, 21, 16),
(43, 22, 4),
(44, 22, 5),
(45, 23, 2),
(46, 23, 1),
(47, 24, 12),
(48, 24, 13),
(49, 25, 12),
(50, 25, 10),
(51, 26, 8),
(52, 26, 9),
(53, 27, 10),
(54, 27, 4),
(55, 28, 16),
(56, 28, 1),
(57, 29, 3),
(58, 29, 1),
(59, 30, 3),
(60, 30, 2),
(61, 31, 3),
(62, 31, 4),
(63, 32, 3),
(64, 32, 5),
(65, 33, 3),
(66, 33, 2),
(67, 34, 5),
(68, 34, 8),
(69, 35, 3),
(70, 35, 1),
(71, 36, 5),
(72, 36, 4),
(73, 37, 4),
(74, 37, 1),
(75, 38, 6),
(76, 38, 8),
(77, 39, 6),
(78, 39, 8),
(79, 40, 2),
(80, 40, 12),
(81, 41, 2),
(82, 41, 12),
(83, 42, 2),
(84, 42, 11),
(85, 43, 1),
(86, 43, 2),
(87, 44, 4),
(88, 44, 2),
(89, 45, 1),
(90, 45, 16),
(91, 46, 17),
(92, 46, 2),
(93, 47, 9),
(94, 47, 10),
(95, 48, 6),
(96, 48, 17),
(97, 49, 2),
(98, 49, 8),
(99, 50, 5),
(100, 50, 8),
(101, 4, 12),
(102, 5, 2),
(103, 6, 2),
(104, 7, 12),
(105, 8, 12),
(106, 8, 7),
(107, 9, 2),
(108, 9, 12),
(109, 10, 12),
(110, 10, 7),
(111, 11, 12),
(112, 11, 7),
(113, 12, 17),
(114, 12, 2),
(115, 13, 8),
(116, 13, 2),
(117, 14, 8),
(118, 14, 2),
(119, 15, 12),
(120, 15, 10),
(121, 16, 13),
(122, 16, 7),
(123, 17, 16),
(124, 17, 1),
(125, 18, 17),
(126, 18, 6),
(127, 19, 2),
(128, 19, 11),
(129, 20, 2),
(130, 20, 17),
(131, 21, 2),
(132, 21, 8),
(133, 22, 2),
(134, 22, 10),
(135, 23, 12),
(136, 23, 16),
(137, 24, 2),
(138, 24, 13),
(139, 25, 16),
(140, 25, 7),
(141, 26, 2),
(142, 26, 6),
(143, 27, 17),
(144, 27, 2),
(145, 28, 2),
(146, 28, 8),
(147, 29, 11),
(148, 29, 17),
(149, 30, 11),
(150, 30, 17),
(151, 31, 11),
(152, 31, 2),
(153, 32, 11),
(154, 32, 2),
(155, 33, 11),
(156, 33, 17),
(157, 34, 2),
(158, 34, 10),
(159, 35, 11),
(160, 35, 17),
(161, 36, 2),
(162, 36, 10),
(163, 37, 2),
(164, 37, 10),
(165, 38, 2),
(166, 38, 17),
(167, 44, 8),
(168, 44, 12),
(169, 45, 10),
(170, 45, 7),
(171, 46, 17),
(172, 46, 7),
(173, 47, 12),
(174, 47, 10),
(175, 48, 12),
(176, 48, 10),
(177, 49, 2),
(178, 49, 9),
(179, 50, 12),
(180, 50, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `core_genre`
--

CREATE TABLE `core_genre` (
  `id` bigint NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_genre`
--

INSERT INTO `core_genre` (`id`, `name`) VALUES
(20, 'Артхаус'),
(4, 'Боевик'),
(19, 'Вестерн'),
(13, 'Военный'),
(9, 'Детектив'),
(15, 'Документальный'),
(2, 'Драма'),
(12, 'Исторический'),
(1, 'Комедия'),
(16, 'Криминал'),
(7, 'Мелодрама'),
(14, 'Музыкальный'),
(3, 'Мультфильм'),
(10, 'Приключения'),
(11, 'Семейный'),
(18, 'Спорт'),
(8, 'Триллер'),
(6, 'Ужасы'),
(5, 'Фантастика'),
(17, 'Фэнтези');

-- --------------------------------------------------------

--
-- Структура таблицы `core_rating`
--

CREATE TABLE `core_rating` (
  `id` bigint NOT NULL,
  `rating` decimal(4,2) NOT NULL,
  `rated_at` datetime(6) NOT NULL,
  `film_id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `comment` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_rating`
--

INSERT INTO `core_rating` (`id`, `rating`, `rated_at`, `film_id`, `user_id`, `comment`) VALUES
(455, '10.00', '2024-01-15 13:45:00.000000', 10, 2, 'Великолепно'),
(457, '7.00', '2024-01-17 18:15:00.000000', 11, 5, 'Приятно'),
(461, '8.00', '2024-01-21 15:15:00.000000', 13, 10, 'Хороший фильм'),
(462, '3.00', '2024-01-22 17:30:00.000000', 14, 2, 'Разочарование'),
(476, '6.00', '2024-02-05 18:00:00.000000', 21, 2, 'Норм'),
(479, '9.00', '2024-02-08 14:45:00.000000', 22, 6, 'Кайф'),
(481, '5.00', '2024-02-10 19:15:00.000000', 23, 8, 'Посмотреть можно'),
(487, '10.00', '2024-02-16 09:45:00.000000', 26, 7, 'Превосходно'),
(490, '5.00', '2024-02-19 17:30:00.000000', 28, 2, 'На троечку'),
(491, '9.00', '2024-02-20 19:45:00.000000', 28, 4, 'Рекомендую'),
(492, '6.00', '2024-02-21 11:00:00.000000', 29, 5, 'Ожидал большего'),
(499, '6.00', '2024-03-01 16:45:00.000000', 32, 5, 'Неплохой'),
(501, '5.00', '2024-03-03 11:15:00.000000', 33, 7, 'Так себе'),
(503, '9.00', '2024-03-05 17:45:00.000000', 34, 10, 'Замечательно'),
(504, '3.00', '2024-03-06 20:00:00.000000', 35, 2, 'Неинтересно'),
(505, '8.00', '2024-03-07 09:15:00.000000', 35, 4, 'Сильно'),
(506, '6.00', '2024-03-08 12:30:00.000000', 36, 5, 'Нормально'),
(508, '4.00', '2024-03-10 18:00:00.000000', 37, 7, 'Не зацепило'),
(511, '9.00', '2024-03-13 14:45:00.000000', 38, 2, 'Кайфово'),
(515, '3.00', '2024-03-17 13:45:00.000000', 40, 7, 'Скучно'),
(517, '5.00', '2024-03-19 18:15:00.000000', 41, 10, 'На один раз'),
(518, '8.00', '2024-03-20 20:30:00.000000', 42, 2, 'Зрелищно'),
(520, '4.00', '2024-03-22 12:00:00.000000', 43, 5, 'Не понравилось'),
(529, '6.00', '2024-03-31 10:15:00.000000', 47, 7, 'Норм'),
(532, '2.00', '2025-03-08 14:06:45.070293', 49, 2, 'Слабовато'),
(534, '5.00', '2024-04-05 14:30:00.000000', 50, 5, 'Так себе'),
(536, '6.00', '2024-04-07 20:00:00.000000', 51, 7, 'Смотреть можно'),
(541, '5.00', '2024-04-12 20:15:00.000000', 53, 5, 'Средненько'),
(543, '7.00', '2025-02-27 21:21:54.099162', 7, 10, 'Не смотрел, но осуждаю'),
(547, '10.00', '2025-05-16 20:33:54.455971', 4, 10, 'хорооош!!!!!'),
(549, '10.00', '2024-06-07 22:34:31.000000', 4, 2, 'Это лучший фильм, что я видел за последнее время!'),
(553, '4.00', '2024-08-20 22:34:31.000000', 4, 5, 'Слишком предсказуемый и скучный.'),
(554, '8.00', '2024-07-13 22:34:31.000000', 4, 1, 'Очень атмосферный, но чего-то не хватило.'),
(555, '10.00', '2024-08-12 22:34:31.000000', 4, 4, '10 из 10, однозначно в топе!'),
(556, '8.00', '2024-05-20 22:34:31.000000', 4, 7, 'Очень атмосферный, но чего-то не хватило.'),
(557, '1.00', '2024-08-13 22:34:31.000000', 4, 6, 'Никакого смысла, просто ужас.'),
(558, '6.00', '2024-10-09 22:34:31.000000', 4, 8, 'Есть хорошие моменты, но в целом средне.'),
(561, '6.00', '2024-08-02 22:34:31.000000', 5, 8, 'Фильм неплох, но не более того.'),
(562, '9.00', '2024-03-09 22:34:31.000000', 5, 1, 'Фильм невероятный, одно из лучших впечатлений!'),
(563, '3.00', '2024-06-15 22:34:31.000000', 5, 6, 'Фильм не зацепил, еле досмотрел.'),
(564, '10.00', '2024-04-26 22:34:31.000000', 5, 7, 'Фильм невероятный, одно из лучших впечатлений!'),
(565, '9.00', '2024-04-25 22:34:31.000000', 5, 2, '10 из 10, однозначно в топе!'),
(568, '1.00', '2024-06-04 22:34:31.000000', 5, 5, 'Никакого смысла, просто ужас.'),
(574, '9.00', '2025-01-11 22:34:31.000000', 6, 5, '10 из 10, однозначно в топе!'),
(575, '1.00', '2024-09-11 22:34:31.000000', 6, 10, 'Никакого смысла, просто ужас.'),
(576, '8.00', '2024-07-20 22:34:31.000000', 6, 4, 'Отличный фильм, но немного затянут.'),
(577, '7.00', '2024-04-22 22:34:31.000000', 6, 1, 'Крепкий фильм, могу рекомендовать.'),
(578, '10.00', '2024-04-08 22:34:31.000000', 6, 6, 'Шедевр! Всем советую!'),
(580, '9.00', '2025-02-24 22:34:31.000000', 7, 4, '10 из 10, однозначно в топе!'),
(582, '5.00', '2024-05-11 22:34:31.000000', 7, 1, 'Обычный фильм, ничего особенного.'),
(584, '1.00', '2025-02-27 22:34:31.000000', 7, 7, 'Никакого смысла, просто ужас.'),
(585, '1.00', '2024-05-20 22:34:31.000000', 7, 6, 'Абсолютный провал.'),
(587, '6.00', '2024-08-08 22:34:31.000000', 7, 8, 'Есть хорошие моменты, но в целом средне.'),
(588, '6.00', '2024-08-27 22:34:31.000000', 7, 2, 'Обычный фильм, ничего особенного.'),
(591, '10.00', '2024-04-06 22:34:31.000000', 8, 10, 'Игра актеров и сюжет – на высоте!'),
(592, '10.00', '2024-07-07 22:34:31.000000', 8, 8, '10 из 10, однозначно в топе!'),
(593, '7.00', '2025-02-18 22:34:31.000000', 8, 1, 'Отличный фильм, но немного затянут.'),
(596, '1.00', '2024-11-20 22:34:31.000000', 8, 5, 'Абсолютный провал.'),
(597, '10.00', '2025-02-27 22:34:31.000000', 8, 4, 'Фильм невероятный, одно из лучших впечатлений!'),
(598, '2.00', '2024-09-19 22:34:31.000000', 8, 2, 'Никакого смысла, просто ужас.'),
(599, '2.00', '2025-02-17 22:34:31.000000', 9, 4, 'Никакого смысла, просто ужас.'),
(600, '10.00', '2024-07-04 22:34:31.000000', 9, 10, 'Это лучший фильм, что я видел за последнее время!'),
(602, '6.00', '2024-08-15 22:34:31.000000', 9, 1, 'Обычный фильм, ничего особенного.'),
(603, '5.00', '2024-04-26 22:34:31.000000', 9, 6, 'Нормально, но пересматривать не стану.'),
(605, '6.00', '2025-02-21 22:34:31.000000', 9, 5, 'Есть хорошие моменты, но в целом средне.'),
(606, '1.00', '2025-01-20 22:34:31.000000', 9, 2, 'Худший фильм, что я видел!'),
(607, '9.00', '2024-08-04 22:34:31.000000', 9, 8, '10 из 10, однозначно в топе!'),
(608, '8.00', '2024-08-24 22:34:31.000000', 9, 7, 'Крепкий фильм, могу рекомендовать.'),
(612, '1.00', '2024-11-28 22:34:31.000000', 10, 1, 'Никакого смысла, просто ужас.'),
(615, '5.00', '2024-06-09 22:34:31.000000', 10, 10, 'Нормально, но пересматривать не стану.'),
(617, '5.00', '2025-03-04 22:34:31.000000', 10, 6, 'Есть хорошие моменты, но в целом средне.'),
(618, '10.00', '2025-02-24 22:34:31.000000', 10, 5, 'Очень круто, давно такого не видел.'),
(622, '9.00', '2024-06-20 22:34:31.000000', 11, 6, 'Это лучший фильм, что я видел за последнее время!'),
(624, '7.00', '2024-08-10 22:34:31.000000', 11, 4, 'Отличный фильм, но немного затянут.'),
(626, '4.00', '2024-08-19 22:34:31.000000', 11, 8, 'Можно было бы сделать интереснее.'),
(627, '10.00', '2024-10-10 22:34:31.000000', 11, 10, '10 из 10, однозначно в топе!'),
(628, '1.00', '2024-08-10 22:34:31.000000', 11, 2, 'Худший фильм, что я видел!'),
(629, '7.00', '2024-03-21 22:34:31.000000', 12, 7, 'Хороший сюжет, но местами скучновато.'),
(632, '9.00', '2025-02-15 22:34:31.000000', 12, 8, 'Очень круто, давно такого не видел.'),
(634, '1.00', '2024-04-09 22:34:31.000000', 12, 6, 'Абсолютный провал.'),
(635, '5.00', '2025-02-02 22:34:31.000000', 12, 10, 'Обычный фильм, ничего особенного.'),
(636, '4.00', '2024-08-14 22:34:31.000000', 12, 4, 'Разочарован, ждал чего-то другого.'),
(637, '6.00', '2024-05-14 22:34:31.000000', 12, 2, 'Сюжет слабоват, но актеры вытянули.'),
(638, '9.00', '2025-03-04 22:34:31.000000', 12, 5, 'Игра актеров и сюжет – на высоте!'),
(644, '5.00', '2024-06-11 22:34:31.000000', 13, 5, 'Нормально, но пересматривать не стану.'),
(645, '1.00', '2024-07-24 22:34:31.000000', 13, 2, 'Худший фильм, что я видел!'),
(646, '5.00', '2025-01-13 22:34:31.000000', 13, 4, 'Есть хорошие моменты, но в целом средне.'),
(647, '3.00', '2024-12-10 22:34:31.000000', 13, 8, 'Слишком предсказуемый и скучный.'),
(648, '10.00', '2024-05-11 22:34:31.000000', 13, 7, '10 из 10, однозначно в топе!'),
(651, '4.00', '2024-05-26 22:34:31.000000', 14, 8, 'Разочарован, ждал чего-то другого.'),
(653, '4.00', '2024-06-29 22:34:31.000000', 14, 7, 'Слишком предсказуемый и скучный.'),
(654, '2.00', '2024-07-22 22:34:31.000000', 14, 10, 'Сценарий, режиссура – все плохо!'),
(656, '5.00', '2025-02-13 22:34:31.000000', 14, 1, 'Нормально, но пересматривать не стану.'),
(657, '7.00', '2024-05-21 22:34:31.000000', 14, 4, 'Отличный фильм, но немного затянут.'),
(658, '10.00', '2024-05-27 22:34:31.000000', 14, 5, 'Игра актеров и сюжет – на высоте!'),
(664, '2.00', '2025-01-30 22:34:31.000000', 15, 6, 'Худший фильм, что я видел!'),
(665, '9.00', '2024-05-17 22:34:31.000000', 15, 5, 'Игра актеров и сюжет – на высоте!'),
(666, '3.00', '2025-02-06 22:34:31.000000', 15, 7, 'Можно было бы сделать интереснее.'),
(667, '1.00', '2024-08-30 22:34:31.000000', 15, 8, 'Худший фильм, что я видел!'),
(668, '8.00', '2025-01-12 22:34:31.000000', 15, 1, 'Очень атмосферный, но чего-то не хватило.'),
(672, '3.00', '2024-03-29 22:34:31.000000', 16, 7, 'Скучно, не рекомендую.'),
(673, '9.00', '2024-08-11 22:34:31.000000', 16, 5, 'Фильм невероятный, одно из лучших впечатлений!'),
(674, '2.00', '2024-03-15 22:34:31.000000', 16, 2, 'Полное разочарование, зря потратил время.'),
(675, '8.00', '2024-09-01 22:34:31.000000', 16, 8, 'Очень атмосферный, но чего-то не хватило.'),
(676, '4.00', '2025-01-07 22:34:31.000000', 16, 6, 'Актерская игра слабая, сюжет не впечатлил.'),
(677, '1.00', '2024-06-22 22:34:31.000000', 16, 1, 'Худший фильм, что я видел!'),
(678, '5.00', '2025-02-16 22:34:31.000000', 16, 4, 'Сюжет слабоват, но актеры вытянули.'),
(682, '4.00', '2024-04-07 22:34:31.000000', 17, 5, 'Скучно, не рекомендую.'),
(683, '10.00', '2024-08-14 22:34:31.000000', 17, 10, 'Шедевр! Всем советую!'),
(684, '1.00', '2024-11-21 22:34:31.000000', 17, 2, 'Полное разочарование, зря потратил время.'),
(686, '6.00', '2024-11-07 22:34:31.000000', 17, 4, 'Обычный фильм, ничего особенного.'),
(687, '1.00', '2024-06-08 22:34:31.000000', 17, 8, 'Абсолютный провал.'),
(688, '6.00', '2025-01-31 22:34:31.000000', 17, 1, 'Есть хорошие моменты, но в целом средне.'),
(692, '4.00', '2025-02-08 22:34:31.000000', 18, 4, 'Слишком предсказуемый и скучный.'),
(693, '8.00', '2024-05-20 22:34:31.000000', 18, 1, 'Хороший сюжет, но местами скучновато.'),
(694, '2.00', '2024-12-09 22:34:31.000000', 18, 6, 'Абсолютный провал.'),
(695, '1.00', '2025-02-19 22:34:31.000000', 18, 8, 'Худший фильм, что я видел!'),
(696, '6.00', '2024-12-17 22:34:31.000000', 18, 7, 'Фильм неплох, но не более того.'),
(697, '2.00', '2025-02-23 22:34:31.000000', 18, 5, 'Никакого смысла, просто ужас.'),
(698, '7.00', '2024-09-07 22:34:31.000000', 18, 2, 'Очень атмосферный, но чего-то не хватило.'),
(701, '7.00', '2025-03-07 22:34:31.000000', 19, 6, 'Хороший сюжет, но местами скучновато.'),
(704, '6.00', '2024-08-26 22:34:31.000000', 19, 10, 'Есть хорошие моменты, но в целом средне.'),
(705, '9.00', '2024-11-03 22:34:31.000000', 19, 4, 'Фильм невероятный, одно из лучших впечатлений!'),
(706, '6.00', '2024-05-16 22:34:31.000000', 19, 7, 'Сюжет слабоват, но актеры вытянули.'),
(708, '8.00', '2024-03-12 22:34:31.000000', 19, 1, 'Отличный фильм, но немного затянут.'),
(711, '6.00', '2024-05-09 22:34:31.000000', 20, 8, 'Нормально, но пересматривать не стану.'),
(712, '5.00', '2025-01-04 22:34:31.000000', 20, 4, 'Сюжет слабоват, но актеры вытянули.'),
(713, '4.00', '2024-05-29 22:34:31.000000', 20, 5, 'Скучно, не рекомендую.'),
(715, '10.00', '2025-01-12 22:34:31.000000', 20, 1, '10 из 10, однозначно в топе!'),
(717, '3.00', '2024-07-03 22:34:31.000000', 20, 10, 'Слишком предсказуемый и скучный.'),
(718, '5.00', '2024-03-27 22:34:31.000000', 20, 2, 'Обычный фильм, ничего особенного.'),
(722, '9.00', '2024-04-01 22:34:31.000000', 21, 4, 'Очень круто, давно такого не видел.'),
(723, '6.00', '2024-08-02 22:34:31.000000', 21, 8, 'Сюжет слабоват, но актеры вытянули.'),
(725, '7.00', '2025-03-07 22:34:31.000000', 21, 6, 'Очень атмосферный, но чего-то не хватило.'),
(728, '5.00', '2024-08-05 22:34:31.000000', 21, 10, 'Есть хорошие моменты, но в целом средне.'),
(734, '10.00', '2024-11-22 22:34:31.000000', 22, 1, 'Игра актеров и сюжет – на высоте!'),
(735, '7.00', '2024-04-18 22:34:31.000000', 22, 5, 'Отличный фильм, но немного затянут.'),
(736, '3.00', '2025-01-23 22:34:31.000000', 22, 7, 'Фильм не зацепил, еле досмотрел.'),
(737, '8.00', '2024-03-30 22:34:31.000000', 22, 8, 'Хороший сюжет, но местами скучновато.'),
(738, '8.00', '2024-12-16 22:34:31.000000', 22, 2, 'Очень атмосферный, но чего-то не хватило.'),
(741, '5.00', '2024-11-03 22:34:31.000000', 23, 10, 'Ожидал большего, но в целом сойдет.'),
(742, '6.00', '2024-11-01 22:34:31.000000', 23, 2, 'Обычный фильм, ничего особенного.'),
(745, '6.00', '2024-09-27 22:34:31.000000', 23, 7, 'Фильм неплох, но не более того.'),
(746, '10.00', '2025-02-16 22:34:31.000000', 23, 5, 'Это лучший фильм, что я видел за последнее время!'),
(747, '1.00', '2025-02-26 22:34:31.000000', 23, 4, 'Никакого смысла, просто ужас.'),
(748, '7.00', '2024-06-06 22:34:31.000000', 23, 1, 'Крепкий фильм, могу рекомендовать.'),
(751, '6.00', '2024-11-16 22:34:31.000000', 24, 4, 'Сюжет слабоват, но актеры вытянули.'),
(753, '2.00', '2024-03-16 22:34:31.000000', 24, 1, 'Худший фильм, что я видел!'),
(755, '7.00', '2024-08-18 22:34:31.000000', 24, 5, 'Хороший сюжет, но местами скучновато.'),
(756, '7.00', '2024-08-23 22:34:31.000000', 24, 2, 'Интересный, но пересматривать не буду.'),
(757, '9.00', '2024-05-29 22:34:31.000000', 24, 10, '10 из 10, однозначно в топе!'),
(758, '9.00', '2025-02-22 22:34:31.000000', 24, 8, 'Очень круто, давно такого не видел.'),
(761, '5.00', '2024-04-22 22:34:31.000000', 25, 6, 'Сюжет слабоват, но актеры вытянули.'),
(762, '8.00', '2024-11-26 22:34:31.000000', 25, 1, 'Отличный фильм, но немного затянут.'),
(763, '1.00', '2024-06-25 22:34:31.000000', 25, 5, 'Полное разочарование, зря потратил время.'),
(764, '6.00', '2024-05-05 22:34:31.000000', 25, 2, 'Сюжет слабоват, но актеры вытянули.'),
(765, '8.00', '2024-09-25 22:34:31.000000', 25, 4, 'Хороший сюжет, но местами скучновато.'),
(766, '5.00', '2024-03-19 22:34:31.000000', 25, 7, 'Сюжет слабоват, но актеры вытянули.'),
(768, '10.00', '2024-11-08 22:34:31.000000', 25, 10, '10 из 10, однозначно в топе!'),
(769, '10.00', '2024-04-06 22:34:31.000000', 26, 6, 'Это лучший фильм, что я видел за последнее время!'),
(774, '4.00', '2024-05-24 22:34:31.000000', 26, 2, 'Можно было бы сделать интереснее.'),
(775, '1.00', '2024-10-25 22:34:31.000000', 26, 4, 'Абсолютный провал.'),
(777, '1.00', '2024-03-12 22:34:31.000000', 26, 1, 'Абсолютный провал.'),
(778, '9.00', '2025-01-31 22:34:31.000000', 26, 10, 'Это лучший фильм, что я видел за последнее время!'),
(784, '4.00', '2024-03-09 22:34:31.000000', 27, 7, 'Можно было бы сделать интереснее.'),
(785, '5.00', '2024-06-18 22:34:31.000000', 27, 10, 'Ожидал большего, но в целом сойдет.'),
(786, '10.00', '2024-06-26 22:34:31.000000', 27, 8, '10 из 10, однозначно в топе!'),
(787, '2.00', '2024-09-05 22:34:31.000000', 27, 1, 'Сценарий, режиссура – все плохо!'),
(788, '6.00', '2024-10-14 22:34:31.000000', 27, 2, 'Ожидал большего, но в целом сойдет.'),
(791, '1.00', '2025-01-02 22:34:31.000000', 28, 6, 'Полное разочарование, зря потратил время.'),
(796, '10.00', '2024-08-05 22:34:31.000000', 28, 8, 'Шедевр! Всем советую!'),
(797, '4.00', '2024-04-27 22:34:31.000000', 28, 10, 'Можно было бы сделать интереснее.'),
(798, '4.00', '2025-01-05 22:34:31.000000', 28, 1, 'Можно было бы сделать интереснее.'),
(799, '1.00', '2024-03-17 22:34:31.000000', 29, 4, 'Сценарий, режиссура – все плохо!'),
(800, '8.00', '2024-09-28 22:34:31.000000', 29, 1, 'Очень атмосферный, но чего-то не хватило.'),
(802, '2.00', '2024-09-12 22:34:31.000000', 29, 8, 'Абсолютный провал.'),
(805, '3.00', '2024-11-18 22:34:31.000000', 29, 7, 'Скучно, не рекомендую.'),
(806, '3.00', '2024-04-04 22:34:31.000000', 29, 2, 'Актерская игра слабая, сюжет не впечатлил.'),
(807, '7.00', '2024-12-26 22:34:31.000000', 29, 6, 'Очень атмосферный, но чего-то не хватило.'),
(808, '3.00', '2024-11-10 22:34:31.000000', 29, 10, 'Можно было бы сделать интереснее.'),
(810, '3.00', '2025-02-04 22:34:31.000000', 30, 1, 'Фильм не зацепил, еле досмотрел.'),
(813, '6.00', '2024-04-22 22:34:31.000000', 30, 7, 'Обычный фильм, ничего особенного.'),
(815, '2.00', '2024-05-14 22:34:31.000000', 30, 8, 'Ужасно! Не тратьте время!'),
(816, '4.00', '2024-10-21 22:34:31.000000', 30, 2, 'Слишком предсказуемый и скучный.'),
(817, '10.00', '2025-02-04 22:34:31.000000', 30, 4, '10 из 10, однозначно в топе!'),
(818, '10.00', '2024-12-15 22:34:31.000000', 30, 6, 'Шедевр! Всем советую!'),
(821, '9.00', '2024-04-03 22:34:31.000000', 31, 8, 'Это лучший фильм, что я видел за последнее время!'),
(822, '3.00', '2024-06-16 22:34:31.000000', 31, 2, 'Актерская игра слабая, сюжет не впечатлил.'),
(825, '3.00', '2025-02-26 22:34:31.000000', 31, 5, 'Фильм не зацепил, еле досмотрел.'),
(826, '10.00', '2024-05-31 22:34:31.000000', 31, 10, 'Очень круто, давно такого не видел.'),
(828, '4.00', '2024-08-05 22:34:31.000000', 31, 6, 'Можно было бы сделать интереснее.'),
(829, '9.00', '2024-05-13 22:34:31.000000', 32, 10, '10 из 10, однозначно в топе!'),
(832, '5.00', '2024-08-10 22:34:31.000000', 32, 7, 'Ожидал большего, но в целом сойдет.'),
(837, '10.00', '2024-10-23 22:34:31.000000', 32, 4, 'Игра актеров и сюжет – на высоте!'),
(838, '9.00', '2024-08-29 22:34:31.000000', 32, 2, 'Шедевр! Всем советую!'),
(839, '3.00', '2024-06-12 22:34:31.000000', 33, 2, 'Разочарован, ждал чего-то другого.'),
(841, '5.00', '2024-07-28 22:34:31.000000', 33, 6, 'Сюжет слабоват, но актеры вытянули.'),
(843, '4.00', '2024-10-29 22:34:31.000000', 33, 4, 'Слишком предсказуемый и скучный.'),
(847, '7.00', '2024-07-02 22:34:31.000000', 33, 10, 'Крепкий фильм, могу рекомендовать.'),
(848, '4.00', '2024-11-25 22:34:31.000000', 33, 8, 'Актерская игра слабая, сюжет не впечатлил.'),
(853, '2.00', '2024-03-12 22:34:31.000000', 34, 4, 'Сценарий, режиссура – все плохо!'),
(854, '4.00', '2024-05-19 22:34:31.000000', 34, 8, 'Слишком предсказуемый и скучный.'),
(855, '9.00', '2024-04-07 22:34:31.000000', 34, 2, 'Шедевр! Всем советую!'),
(856, '10.00', '2024-06-27 22:34:31.000000', 34, 7, 'Очень круто, давно такого не видел.'),
(858, '9.00', '2024-08-23 22:34:31.000000', 34, 1, 'Шедевр! Всем советую!'),
(859, '1.00', '2024-04-06 22:34:31.000000', 35, 8, 'Ужасно! Не тратьте время!'),
(866, '2.00', '2024-09-28 22:34:31.000000', 35, 1, 'Никакого смысла, просто ужас.'),
(868, '9.00', '2024-09-11 22:34:31.000000', 35, 7, 'Фильм невероятный, одно из лучших впечатлений!'),
(873, '10.00', '2025-01-04 22:34:31.000000', 36, 7, 'Фильм невероятный, одно из лучших впечатлений!'),
(876, '8.00', '2024-05-15 22:34:31.000000', 36, 4, 'Крепкий фильм, могу рекомендовать.'),
(877, '7.00', '2024-03-30 22:34:31.000000', 36, 1, 'Хороший сюжет, но местами скучновато.'),
(878, '8.00', '2024-07-20 22:34:31.000000', 36, 10, 'Концовка неожиданная, мне понравилось!'),
(883, '5.00', '2024-09-11 22:34:31.000000', 37, 1, 'Фильм неплох, но не более того.'),
(885, '2.00', '2024-08-29 22:34:31.000000', 37, 4, 'Абсолютный провал.'),
(886, '5.00', '2024-05-25 22:34:31.000000', 37, 8, 'Фильм неплох, но не более того.'),
(887, '1.00', '2025-01-21 22:34:31.000000', 37, 10, 'Ужасно! Не тратьте время!'),
(888, '2.00', '2024-09-16 22:34:31.000000', 37, 5, 'Никакого смысла, просто ужас.'),
(891, '3.00', '2024-05-23 22:34:31.000000', 38, 7, 'Актерская игра слабая, сюжет не впечатлил.'),
(892, '8.00', '2025-01-07 22:34:31.000000', 38, 5, 'Очень атмосферный, но чего-то не хватило.'),
(893, '5.00', '2024-12-29 22:34:31.000000', 38, 6, 'Фильм неплох, но не более того.'),
(896, '9.00', '2024-10-12 22:34:31.000000', 38, 10, 'Это лучший фильм, что я видел за последнее время!'),
(898, '4.00', '2024-10-31 22:34:31.000000', 38, 1, 'Можно было бы сделать интереснее.'),
(899, '5.00', '2024-08-06 22:34:31.000000', 39, 2, 'Фильм неплох, но не более того.'),
(900, '3.00', '2025-02-03 22:34:31.000000', 39, 1, 'Разочарован, ждал чего-то другого.'),
(903, '8.00', '2024-09-22 22:34:31.000000', 39, 7, 'Хороший сюжет, но местами скучновато.'),
(905, '3.00', '2024-04-21 22:34:31.000000', 39, 5, 'Разочарован, ждал чего-то другого.'),
(906, '6.00', '2024-11-16 22:34:31.000000', 39, 6, 'Сюжет слабоват, но актеры вытянули.'),
(907, '10.00', '2024-07-20 22:34:31.000000', 39, 4, 'Игра актеров и сюжет – на высоте!'),
(908, '3.00', '2024-05-13 22:34:31.000000', 39, 8, 'Фильм не зацепил, еле досмотрел.'),
(909, '7.00', '2024-06-15 22:34:31.000000', 40, 5, 'Крепкий фильм, могу рекомендовать.'),
(910, '1.00', '2024-08-07 22:34:31.000000', 40, 10, 'Полное разочарование, зря потратил время.'),
(912, '2.00', '2024-09-14 22:34:31.000000', 40, 4, 'Ужасно! Не тратьте время!'),
(915, '5.00', '2024-08-09 22:34:31.000000', 40, 2, 'Ожидал большего, но в целом сойдет.'),
(916, '8.00', '2024-10-04 22:34:31.000000', 40, 8, 'Хороший сюжет, но местами скучновато.'),
(917, '2.00', '2025-01-15 22:34:31.000000', 40, 1, 'Сценарий, режиссура – все плохо!'),
(918, '8.00', '2024-06-27 22:34:31.000000', 40, 6, 'Отличный фильм, но немного затянут.'),
(920, '5.00', '2024-06-15 22:34:31.000000', 41, 1, 'Сюжет слабоват, но актеры вытянули.'),
(922, '9.00', '2025-01-05 22:34:31.000000', 41, 7, 'Шедевр! Всем советую!'),
(926, '3.00', '2024-09-29 22:34:31.000000', 41, 8, 'Слишком предсказуемый и скучный.'),
(927, '2.00', '2024-10-26 22:34:31.000000', 41, 6, 'Никакого смысла, просто ужас.'),
(928, '4.00', '2024-09-04 22:34:31.000000', 41, 4, 'Фильм не зацепил, еле досмотрел.'),
(931, '8.00', '2024-03-14 22:34:31.000000', 42, 8, 'Хороший сюжет, но местами скучновато.'),
(932, '7.00', '2024-08-18 22:34:31.000000', 42, 1, 'Очень атмосферный, но чего-то не хватило.'),
(933, '8.00', '2024-05-03 22:34:31.000000', 42, 7, 'Отличный фильм, но немного затянут.'),
(936, '9.00', '2024-11-15 22:34:31.000000', 42, 10, 'Игра актеров и сюжет – на высоте!'),
(937, '7.00', '2024-10-10 22:34:31.000000', 42, 6, 'Концовка неожиданная, мне понравилось!'),
(938, '10.00', '2025-03-02 22:34:31.000000', 42, 4, 'Фильм невероятный, одно из лучших впечатлений!'),
(943, '10.00', '2024-11-15 22:34:31.000000', 43, 10, 'Это лучший фильм, что я видел за последнее время!'),
(944, '8.00', '2024-10-15 22:34:31.000000', 43, 8, 'Хороший сюжет, но местами скучновато.'),
(946, '10.00', '2024-05-18 22:34:31.000000', 43, 7, 'Очень круто, давно такого не видел.'),
(947, '4.00', '2024-05-16 22:34:31.000000', 43, 2, 'Слишком предсказуемый и скучный.'),
(948, '9.00', '2024-11-16 22:34:31.000000', 43, 4, 'Фильм невероятный, одно из лучших впечатлений!'),
(950, '5.00', '2024-07-25 22:34:31.000000', 44, 1, 'Сюжет слабоват, но актеры вытянули.'),
(951, '10.00', '2024-05-07 22:34:31.000000', 44, 7, 'Очень круто, давно такого не видел.'),
(952, '8.00', '2025-01-10 22:34:31.000000', 44, 2, 'Отличный фильм, но немного затянут.'),
(953, '1.00', '2024-03-08 22:34:31.000000', 44, 5, 'Ужасно! Не тратьте время!'),
(954, '5.00', '2024-04-23 22:34:31.000000', 44, 4, 'Обычный фильм, ничего особенного.'),
(955, '9.00', '2024-11-28 22:34:31.000000', 44, 8, 'Шедевр! Всем советую!'),
(956, '4.00', '2024-05-28 22:34:31.000000', 44, 6, 'Фильм не зацепил, еле досмотрел.'),
(958, '9.00', '2024-09-17 22:34:31.000000', 44, 10, 'Это лучший фильм, что я видел за последнее время!'),
(959, '4.00', '2024-09-21 22:34:31.000000', 45, 4, 'Актерская игра слабая, сюжет не впечатлил.'),
(961, '2.00', '2024-06-06 22:34:31.000000', 45, 10, 'Никакого смысла, просто ужас.'),
(962, '6.00', '2025-02-23 22:34:31.000000', 45, 8, 'Фильм неплох, но не более того.'),
(964, '10.00', '2024-09-12 22:34:31.000000', 45, 6, '10 из 10, однозначно в топе!'),
(966, '7.00', '2025-02-21 22:34:31.000000', 45, 1, 'Очень атмосферный, но чего-то не хватило.'),
(967, '4.00', '2024-08-21 22:34:31.000000', 45, 2, 'Скучно, не рекомендую.'),
(968, '4.00', '2024-05-10 22:34:31.000000', 45, 7, 'Фильм не зацепил, еле досмотрел.'),
(969, '4.00', '2024-08-13 22:34:31.000000', 46, 7, 'Актерская игра слабая, сюжет не впечатлил.'),
(971, '7.00', '2024-12-22 22:34:31.000000', 46, 5, 'Крепкий фильм, могу рекомендовать.'),
(972, '10.00', '2024-04-08 22:34:31.000000', 46, 10, 'Игра актеров и сюжет – на высоте!'),
(976, '2.00', '2024-12-27 22:34:31.000000', 46, 2, 'Сценарий, режиссура – все плохо!'),
(977, '4.00', '2024-07-26 22:34:31.000000', 46, 8, 'Фильм не зацепил, еле досмотрел.'),
(978, '9.00', '2024-11-27 22:34:31.000000', 46, 4, 'Шедевр! Всем советую!'),
(979, '8.00', '2024-10-08 22:34:31.000000', 47, 8, 'Крепкий фильм, могу рекомендовать.'),
(985, '1.00', '2024-04-28 22:34:31.000000', 47, 2, 'Худший фильм, что я видел!'),
(986, '6.00', '2025-01-06 22:34:31.000000', 47, 6, 'Обычный фильм, ничего особенного.'),
(987, '7.00', '2024-08-30 22:34:31.000000', 47, 10, 'Концовка неожиданная, мне понравилось!'),
(988, '2.00', '2024-10-15 22:34:31.000000', 47, 4, 'Сценарий, режиссура – все плохо!'),
(991, '10.00', '2024-10-30 22:34:31.000000', 48, 8, 'Игра актеров и сюжет – на высоте!'),
(994, '3.00', '2024-10-15 22:34:31.000000', 48, 6, 'Фильм не зацепил, еле досмотрел.'),
(996, '2.00', '2024-06-27 22:34:31.000000', 48, 7, 'Сценарий, режиссура – все плохо!'),
(997, '6.00', '2024-12-20 22:34:31.000000', 48, 4, 'Ожидал большего, но в целом сойдет.'),
(998, '4.00', '2024-12-31 22:34:31.000000', 48, 10, 'Фильм не зацепил, еле досмотрел.'),
(1002, '4.00', '2024-11-17 22:34:31.000000', 49, 8, 'Скучно, не рекомендую.'),
(1004, '5.00', '2024-09-26 22:34:31.000000', 49, 4, 'Обычный фильм, ничего особенного.'),
(1005, '2.00', '2024-03-16 22:34:31.000000', 49, 1, 'Абсолютный провал.'),
(1007, '8.00', '2024-05-14 22:34:31.000000', 49, 6, 'Очень атмосферный, но чего-то не хватило.'),
(1008, '8.00', '2024-10-28 22:34:31.000000', 49, 7, 'Крепкий фильм, могу рекомендовать.'),
(1011, '9.00', '2025-01-10 22:34:31.000000', 50, 6, 'Это лучший фильм, что я видел за последнее время!'),
(1012, '3.00', '2024-05-17 22:34:31.000000', 50, 4, 'Разочарован, ждал чего-то другого.'),
(1016, '1.00', '2024-07-30 22:34:31.000000', 50, 8, 'Худший фильм, что я видел!'),
(1017, '10.00', '2024-08-12 22:34:31.000000', 50, 1, 'Это лучший фильм, что я видел за последнее время!'),
(1018, '9.00', '2024-10-29 22:34:31.000000', 50, 7, '10 из 10, однозначно в топе!'),
(1022, '8.00', '2024-09-30 22:34:31.000000', 51, 2, 'Концовка неожиданная, мне понравилось!'),
(1024, '1.00', '2024-08-03 22:34:31.000000', 51, 6, 'Полное разочарование, зря потратил время.'),
(1026, '2.00', '2024-04-28 22:34:31.000000', 51, 1, 'Сценарий, режиссура – все плохо!'),
(1027, '4.00', '2024-06-03 22:34:31.000000', 51, 4, 'Можно было бы сделать интереснее.'),
(1028, '2.00', '2024-07-12 22:34:31.000000', 51, 8, 'Худший фильм, что я видел!'),
(1031, '9.00', '2024-07-05 22:34:31.000000', 52, 4, 'Шедевр! Всем советую!'),
(1032, '5.00', '2024-10-17 22:34:31.000000', 52, 7, 'Нормально, но пересматривать не стану.'),
(1034, '4.00', '2024-05-04 22:34:31.000000', 52, 2, 'Слишком предсказуемый и скучный.'),
(1035, '2.00', '2024-10-31 22:34:31.000000', 52, 10, 'Худший фильм, что я видел!'),
(1036, '2.00', '2025-02-26 22:34:31.000000', 52, 6, 'Полное разочарование, зря потратил время.'),
(1038, '8.00', '2024-12-29 22:34:31.000000', 52, 1, 'Интересный, но пересматривать не буду.'),
(1041, '9.00', '2024-10-08 22:34:31.000000', 53, 4, 'Фильм невероятный, одно из лучших впечатлений!'),
(1044, '3.00', '2024-04-03 22:34:31.000000', 53, 2, 'Актерская игра слабая, сюжет не впечатлил.'),
(1046, '1.00', '2024-05-29 22:34:31.000000', 53, 8, 'Абсолютный провал.'),
(1047, '2.00', '2024-08-20 22:34:31.000000', 53, 7, 'Полное разочарование, зря потратил время.'),
(1048, '8.00', '2024-09-22 22:34:31.000000', 53, 10, 'Отличный фильм, но немного затянут.'),
(1050, '6.00', '2025-05-08 22:20:54.297587', 15, 10, '456'),
(1051, '10.00', '2025-05-08 22:22:51.092503', 6, 14, '3'),
(1052, '3.00', '2025-05-16 20:48:31.584312', 4, 17, 'ейукейуке');

-- --------------------------------------------------------

--
-- Структура таблицы `core_userprofile`
--

CREATE TABLE `core_userprofile` (
  `id` bigint NOT NULL,
  `avatar` varchar(100) DEFAULT NULL,
  `user_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `core_userprofile`
--

INSERT INTO `core_userprofile` (`id`, `avatar`, `user_id`) VALUES
(1, 'avatars/user_6/Slava_KPSS_slushaet_novy_albom_OXXXY.gif', 6),
(2, 'avatars/default.png', 1),
(3, 'avatars/user_2/xqc-xqcl.gif', 2),
(4, 'avatars/default.png', 4),
(5, 'avatars/default.png', 5),
(6, 'avatars/default.png', 7),
(7, 'avatars/user_8/08c86ec56c6911efb42c5e708ac16c58_1.jpg', 8),
(9, 'avatars/user_10/изображение_2025-02-27_204809503.png', 10),
(11, 'avatars/default.png', 12),
(12, 'avatars/default.png', 13),
(13, 'avatars/default.png', 14),
(16, 'avatars/user_17/изображение_2025-05-16_234553335.png', 17),
(17, 'avatars/user_18/tenor.gif', 18);

-- --------------------------------------------------------

--
-- Структура таблицы `core_watchhistory`
--

CREATE TABLE `core_watchhistory` (
  `id` bigint NOT NULL,
  `watched_at` datetime(6) NOT NULL,
  `film_id` bigint NOT NULL,
  `user_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `django_admin_log`
--

CREATE TABLE `django_admin_log` (
  `id` int NOT NULL,
  `action_time` datetime(6) NOT NULL,
  `object_id` longtext,
  `object_repr` varchar(200) NOT NULL,
  `action_flag` smallint UNSIGNED NOT NULL,
  `change_message` longtext NOT NULL,
  `content_type_id` int DEFAULT NULL,
  `user_id` int NOT NULL
) ;

--
-- Дамп данных таблицы `django_admin_log`
--

INSERT INTO `django_admin_log` (`id`, `action_time`, `object_id`, `object_repr`, `action_flag`, `change_message`, `content_type_id`, `user_id`) VALUES
(1, '2025-02-05 14:52:27.896163', '1', 'Смертельное оружие', 1, '[{\"added\": {}}]', 7, 1),
(2, '2025-02-05 14:52:44.457737', '2', 'Подводная братва', 1, '[{\"added\": {}}]', 7, 1),
(3, '2025-02-05 15:42:28.073348', '3', 'Крутой Хакер', 1, '[{\"added\": {}}]', 7, 1),
(4, '2025-02-05 17:05:50.607263', '2', 'Подводная братва', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(5, '2025-02-05 17:36:35.087791', '1', 'Комедия', 1, '[{\"added\": {}}]', 8, 1),
(6, '2025-02-05 17:36:37.601379', '2', 'Драма', 1, '[{\"added\": {}}]', 8, 1),
(7, '2025-02-05 17:36:41.660540', '3', 'Мультфильм', 1, '[{\"added\": {}}]', 8, 1),
(8, '2025-02-05 17:40:02.907824', '1', 'FilmGenre object (1)', 1, '[{\"added\": {}}]', 11, 1),
(9, '2025-02-05 17:40:08.823609', '1', 'FilmGenre object (1)', 2, '[{\"changed\": {\"fields\": [\"Genre\"]}}]', 11, 1),
(10, '2025-02-05 17:40:21.555800', '1', 'FilmGenre object (1)', 2, '[{\"changed\": {\"fields\": [\"Genre\"]}}]', 11, 1),
(11, '2025-02-05 19:25:59.615010', '3', 'Крутой Хакер', 3, '', 7, 1),
(12, '2025-02-05 19:25:59.615010', '2', 'Подводная братва', 3, '', 7, 1),
(13, '2025-02-05 19:25:59.615010', '1', 'Смертельное оружие', 3, '', 7, 1),
(14, '2025-02-05 19:53:22.232519', '53', 'Гран Торино', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(15, '2025-02-05 19:54:36.193848', '52', 'Малышка на миллион', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(16, '2025-02-05 19:54:39.636391', '51', 'Трон: Наследие', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(17, '2025-02-05 19:54:42.877455', '50', 'Бегущий по лезвию', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(18, '2025-02-05 19:55:01.026807', '49', 'Малхолланд Драйв', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(19, '2025-02-05 19:56:10.361363', '48', 'Дракула', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(20, '2025-02-05 19:56:14.673520', '47', 'Шерлок Холмс', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(21, '2025-02-05 19:56:17.648434', '46', 'Игра престолов', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(22, '2025-02-05 19:56:21.778480', '45', 'Большой куш', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(23, '2025-02-05 19:56:28.644234', '44', 'Леон', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(24, '2025-02-05 19:56:34.344907', '43', 'Достучаться до небес', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(25, '2025-02-05 19:56:38.284492', '42', 'Хатико: Самый верный друг', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(26, '2025-02-05 19:56:42.881079', '41', 'Список Шиндлера', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(27, '2025-02-05 19:56:46.825509', '40', 'Пианист', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(28, '2025-02-05 19:56:52.087948', '39', 'Сияние', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(29, '2025-02-05 19:56:57.373834', '38', 'Оно', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(30, '2025-02-05 19:57:14.616391', '37', 'Дэдпул', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(31, '2025-02-05 19:57:19.444864', '36', 'Люди Икс: Дни минувшего будущего', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(32, '2025-02-05 19:57:23.759454', '35', 'Мадагаскар', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(33, '2025-02-05 19:57:28.161746', '34', 'Гравитация', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(34, '2025-02-05 19:57:36.536474', '33', 'Тайна Коко', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(35, '2025-02-05 19:57:44.904087', '32', 'Валл-И', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(36, '2025-02-05 19:57:48.708143', '31', 'Человек-паук: Через вселенные', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(37, '2025-02-05 19:57:53.664085', '30', 'Король Лев', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(38, '2025-02-05 19:57:56.976254', '29', 'Шрек', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(39, '2025-02-05 19:57:59.747163', '28', 'Криминальное чтиво', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(40, '2025-02-05 19:58:02.663686', '27', 'Индиана Джонс: В поисках утраченного ковчега', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(41, '2025-02-05 19:58:05.824137', '26', 'Остров проклятых', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(42, '2025-02-05 19:58:09.917580', '25', 'Джанго освобожденный', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(43, '2025-02-05 19:58:12.827611', '24', 'Дюнкерк', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(44, '2025-02-05 19:58:15.038065', '23', 'Однажды в Голливуде', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(45, '2025-02-05 19:58:17.639212', '22', 'Мстители: Финал', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(46, '2025-02-05 19:58:22.441247', '21', 'Джокер', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(47, '2025-02-05 19:58:24.851714', '20', 'Аватар', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(48, '2025-02-05 19:58:27.616459', '19', 'Гарри Поттер и философский камень', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(49, '2025-02-05 19:58:30.655402', '18', 'Пираты Карибского моря: Проклятие Черной жемчужины', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(50, '2025-02-05 19:58:33.827468', '17', 'Бойцовский клуб', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(51, '2025-02-05 19:58:37.296389', '16', 'Гладиатор', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(52, '2025-02-05 19:58:40.322154', '15', 'Титаник', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(53, '2025-02-05 19:58:43.594581', '14', 'Чужой', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(54, '2025-02-05 19:58:46.957505', '13', 'Терминатор 2: Судный день', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(55, '2025-02-05 19:58:50.132905', '12', 'Звездные войны: Эпизод IV – Новая надежда', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(56, '2025-02-05 19:58:52.499458', '11', 'Форрест Гамп', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(57, '2025-02-05 19:58:55.088838', '10', 'Побег из Шоушенка', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(58, '2025-02-05 19:59:01.682302', '9', 'Темный рыцарь', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(59, '2025-02-05 19:59:04.194102', '8', 'Крестный отец', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(60, '2025-02-05 19:59:06.912316', '7', 'Властелин колец: Братство кольца', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(61, '2025-02-05 19:59:09.785938', '6', 'Матрица', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(62, '2025-02-05 19:59:13.247483', '5', 'Начало', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(63, '2025-02-05 19:59:16.382387', '4', 'Интерстеллар', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(64, '2025-02-05 21:28:40.380415', '5', 'Начало', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(65, '2025-02-05 21:29:35.829619', '5', 'Начало', 2, '[{\"changed\": {\"fields\": [\"Image\"]}}]', 7, 1),
(66, '2025-02-06 18:57:32.315206', '4', 'Интерстеллар', 2, '[{\"changed\": {\"fields\": [\"Video\"]}}]', 7, 1),
(67, '2025-02-06 19:48:43.420711', '5', 'Начало', 2, '[{\"changed\": {\"fields\": [\"Video\"]}}]', 7, 1),
(68, '2025-02-23 22:46:38.625852', '1', 'DanilRomashkan', 1, '[{\"added\": {}}]', 17, 1),
(69, '2025-02-27 16:02:59.701024', '9', 'EdemOsmanov', 3, '', 4, 1),
(70, '2025-03-02 22:02:01.890834', '7', 'Властелин колец: Братство кольца', 2, '[{\"changed\": {\"fields\": [\"Video\"]}}]', 7, 1),
(71, '2025-05-12 18:46:52.129025', '53', 'Гран Торино', 2, '[{\"changed\": {\"fields\": [\"Video\"]}}]', 7, 1),
(72, '2025-05-16 20:38:27.045628', '6', 'DanilRomashkan', 2, '[{\"changed\": {\"fields\": [\"First name\"]}}]', 4, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `django_content_type`
--

CREATE TABLE `django_content_type` (
  `id` int NOT NULL,
  `app_label` varchar(100) NOT NULL,
  `model` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `django_content_type`
--

INSERT INTO `django_content_type` (`id`, `app_label`, `model`) VALUES
(1, 'admin', 'logentry'),
(3, 'auth', 'group'),
(2, 'auth', 'permission'),
(4, 'auth', 'user'),
(15, 'authtoken', 'token'),
(16, 'authtoken', 'tokenproxy'),
(18, 'axes', 'accessattempt'),
(20, 'axes', 'accessfailurelog'),
(19, 'axes', 'accesslog'),
(5, 'contenttypes', 'contenttype'),
(10, 'core', 'comment'),
(7, 'core', 'film'),
(11, 'core', 'filmgenre'),
(8, 'core', 'genre'),
(13, 'core', 'like'),
(12, 'core', 'rating'),
(9, 'core', 'user'),
(17, 'core', 'userprofile'),
(14, 'core', 'watchhistory'),
(6, 'sessions', 'session');

-- --------------------------------------------------------

--
-- Структура таблицы `django_migrations`
--

CREATE TABLE `django_migrations` (
  `id` bigint NOT NULL,
  `app` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `applied` datetime(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `django_migrations`
--

INSERT INTO `django_migrations` (`id`, `app`, `name`, `applied`) VALUES
(1, 'contenttypes', '0001_initial', '2025-02-05 14:35:32.893055'),
(2, 'auth', '0001_initial', '2025-02-05 14:35:35.445469'),
(3, 'admin', '0001_initial', '2025-02-05 14:35:35.805565'),
(4, 'admin', '0002_logentry_remove_auto_add', '2025-02-05 14:35:35.810526'),
(5, 'admin', '0003_logentry_add_action_flag_choices', '2025-02-05 14:35:35.816476'),
(6, 'contenttypes', '0002_remove_content_type_name', '2025-02-05 14:35:35.920140'),
(7, 'auth', '0002_alter_permission_name_max_length', '2025-02-05 14:35:36.002972'),
(8, 'auth', '0003_alter_user_email_max_length', '2025-02-05 14:35:36.017853'),
(9, 'auth', '0004_alter_user_username_opts', '2025-02-05 14:35:36.022812'),
(10, 'auth', '0005_alter_user_last_login_null', '2025-02-05 14:35:36.113581'),
(11, 'auth', '0006_require_contenttypes_0002', '2025-02-05 14:35:36.114077'),
(12, 'auth', '0007_alter_validators_add_error_messages', '2025-02-05 14:35:36.119037'),
(13, 'auth', '0008_alter_user_username_max_length', '2025-02-05 14:35:36.225676'),
(14, 'auth', '0009_alter_user_last_name_max_length', '2025-02-05 14:35:36.310989'),
(15, 'auth', '0010_alter_group_name_max_length', '2025-02-05 14:35:36.321900'),
(16, 'auth', '0011_update_proxy_permissions', '2025-02-05 14:35:36.326860'),
(17, 'auth', '0012_alter_user_first_name_max_length', '2025-02-05 14:35:36.423580'),
(18, 'core', '0001_initial', '2025-02-05 14:35:38.069307'),
(19, 'sessions', '0001_initial', '2025-02-05 14:35:38.181404'),
(20, 'core', '0002_film_image', '2025-02-05 15:41:33.630985'),
(21, 'core', '0003_remove_film_rating_film_genres_rating_comment_and_more', '2025-02-06 14:33:16.700612'),
(22, 'core', '0004_film_video_url', '2025-02-06 18:38:02.345720'),
(23, 'core', '0005_remove_film_video_url_film_video', '2025-02-06 18:56:56.287747'),
(24, 'authtoken', '0001_initial', '2025-02-07 16:31:56.483901'),
(25, 'authtoken', '0002_auto_20160226_1747', '2025-02-07 16:31:56.514778'),
(26, 'authtoken', '0003_tokenproxy', '2025-02-07 16:31:56.516267'),
(27, 'authtoken', '0004_alter_tokenproxy_options', '2025-02-07 16:31:56.518746'),
(28, 'core', '0006_alter_user_options_alter_user_managers_and_more', '2025-02-07 20:18:58.555290'),
(29, 'core', '0007_alter_rating_user_alter_comment_user_and_more', '2025-02-07 20:53:08.732821'),
(30, 'core', '0008_alter_rating_rating', '2025-02-08 20:45:29.794943'),
(31, 'core', '0009_alter_rating_rating', '2025-02-08 20:47:16.578248'),
(32, 'core', '0010_alter_rating_film_userprofile', '2025-02-23 22:44:24.535856'),
(33, 'axes', '0001_initial', '2025-05-06 10:20:18.370727'),
(34, 'axes', '0002_auto_20151217_2044', '2025-05-06 10:20:19.472036'),
(35, 'axes', '0003_auto_20160322_0929', '2025-05-06 10:20:19.482453'),
(36, 'axes', '0004_auto_20181024_1538', '2025-05-06 10:20:19.491877'),
(37, 'axes', '0005_remove_accessattempt_trusted', '2025-05-06 10:20:20.156219'),
(38, 'axes', '0006_remove_accesslog_trusted', '2025-05-06 10:20:20.805724'),
(39, 'axes', '0007_alter_accessattempt_unique_together', '2025-05-06 10:20:20.898294'),
(40, 'axes', '0008_accessfailurelog', '2025-05-06 10:20:21.035265'),
(41, 'axes', '0009_add_session_hash', '2025-05-06 10:20:21.046166'),
(42, 'core', '0011_remove_film_video_film_video_file_and_more', '2025-05-12 18:40:26.239422'),
(43, 'core', '0012_rename_video_file_film_video', '2025-05-12 18:41:24.137258');

-- --------------------------------------------------------

--
-- Структура таблицы `django_session`
--

CREATE TABLE `django_session` (
  `session_key` varchar(40) NOT NULL,
  `session_data` longtext NOT NULL,
  `expire_date` datetime(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `django_session`
--

INSERT INTO `django_session` (`session_key`, `session_data`, `expire_date`) VALUES
('bs6fetu8mct7jgety9pxvz79wesgdwsr', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1tfgkp:PZv42bYl3f1x1ZvyCRDU6NhIrheNDPJeZwh-gzeV0Lg', '2025-02-19 14:51:51.437530'),
('gui8h587m0y1akjhy1zxlrqkgup5gn97', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1tngLL:0bMtXN9LISRpb6OtiUh6rlvgnc-WjBD-oYS2tsFSE-Q', '2025-03-13 16:02:35.800703'),
('jgw7y7w3ar3ofn6ezqg26v3njrnog1bv', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1tmKid:Dzm1DJBpgpjt1MElv7bWFYkjVXFvh0U8pnpwk0y8NRE', '2025-03-09 22:45:03.345156'),
('ko5cuhgv39sk6b8d8wf5m5vs82elqhqm', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1uG1oX:IJF45vgXYCAxYcC0CSCpJviZy8pK2mYlMCCjU7ez6XE', '2025-05-30 20:37:53.953681'),
('l5csrp21yqge7lbx71b6zmgtl3u46ma6', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1uEYA9:8sCMigUod8uEvMYEK7Lpe7jIYOieX3ans93oVfB7y54', '2025-05-26 18:46:05.122093'),
('lf6tyd5oi390czp5bas0e6ijwbfdeqt0', '.eJxVjDsOwyAQRO9CHSEgy8cp0-cMaGEhOIlAMnYV5e6xJRd2N5r3Zr7M4zIXv_Q0-ZHYjUl2OXYB4zvVDdAL67Px2Oo8jYFvCt9p549G6XPf3dNBwV7WtXUI16wFyoQgADQNWbhgwRqTTIhkhXIWJMnBgMuocM05kjQ5oNKC_f7PMjeb:1tg6m2:knqzj8nSntGVBflX-X4-mCIzXoI2HTofhfYUAbS0Cpg', '2025-02-20 18:38:50.045602');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `authtoken_token`
--
ALTER TABLE `authtoken_token`
  ADD PRIMARY KEY (`key`),
  ADD UNIQUE KEY `user_id` (`user_id`);

--
-- Индексы таблицы `auth_group`
--
ALTER TABLE `auth_group`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `auth_group_permissions`
--
ALTER TABLE `auth_group_permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `auth_group_permissions_group_id_permission_id_0cd325b0_uniq` (`group_id`,`permission_id`),
  ADD KEY `auth_group_permissio_permission_id_84c5c92e_fk_auth_perm` (`permission_id`);

--
-- Индексы таблицы `auth_permission`
--
ALTER TABLE `auth_permission`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `auth_permission_content_type_id_codename_01ab375a_uniq` (`content_type_id`,`codename`);

--
-- Индексы таблицы `auth_user`
--
ALTER TABLE `auth_user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Индексы таблицы `auth_user_groups`
--
ALTER TABLE `auth_user_groups`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `auth_user_groups_user_id_group_id_94350c0c_uniq` (`user_id`,`group_id`),
  ADD KEY `auth_user_groups_group_id_97559544_fk_auth_group_id` (`group_id`);

--
-- Индексы таблицы `auth_user_user_permissions`
--
ALTER TABLE `auth_user_user_permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `auth_user_user_permissions_user_id_permission_id_14a6b632_uniq` (`user_id`,`permission_id`),
  ADD KEY `auth_user_user_permi_permission_id_1fbb5f2c_fk_auth_perm` (`permission_id`);

--
-- Индексы таблицы `axes_accessattempt`
--
ALTER TABLE `axes_accessattempt`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `axes_accessattempt_username_ip_address_user_agent_8ea22282_uniq` (`username`,`ip_address`,`user_agent`),
  ADD KEY `axes_accessattempt_ip_address_10922d9c` (`ip_address`),
  ADD KEY `axes_accessattempt_user_agent_ad89678b` (`user_agent`),
  ADD KEY `axes_accessattempt_username_3f2d4ca0` (`username`);

--
-- Индексы таблицы `axes_accessfailurelog`
--
ALTER TABLE `axes_accessfailurelog`
  ADD PRIMARY KEY (`id`),
  ADD KEY `axes_accessfailurelog_user_agent_ea145dda` (`user_agent`),
  ADD KEY `axes_accessfailurelog_ip_address_2e9f5a7f` (`ip_address`),
  ADD KEY `axes_accessfailurelog_username_a8b7e8a4` (`username`);

--
-- Индексы таблицы `axes_accesslog`
--
ALTER TABLE `axes_accesslog`
  ADD PRIMARY KEY (`id`),
  ADD KEY `axes_accesslog_ip_address_86b417e5` (`ip_address`),
  ADD KEY `axes_accesslog_user_agent_0e659004` (`user_agent`),
  ADD KEY `axes_accesslog_username_df93064b` (`username`);

--
-- Индексы таблицы `core_comment`
--
ALTER TABLE `core_comment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `core_comment_film_id_144ac814_fk_core_film_id` (`film_id`),
  ADD KEY `core_comment_user_id_a9a9430c_fk_auth_user_id` (`user_id`);

--
-- Индексы таблицы `core_film`
--
ALTER TABLE `core_film`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `core_filmgenre`
--
ALTER TABLE `core_filmgenre`
  ADD PRIMARY KEY (`id`),
  ADD KEY `core_filmgenre_film_id_735b951b_fk_core_film_id` (`film_id`),
  ADD KEY `core_filmgenre_genre_id_120b0339_fk_core_genre_id` (`genre_id`);

--
-- Индексы таблицы `core_genre`
--
ALTER TABLE `core_genre`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `core_rating`
--
ALTER TABLE `core_rating`
  ADD PRIMARY KEY (`id`),
  ADD KEY `core_rating_film_id_ae4d1594_fk_core_film_id` (`film_id`),
  ADD KEY `core_rating_user_id_0c12e4af_fk_auth_user_id` (`user_id`);

--
-- Индексы таблицы `core_userprofile`
--
ALTER TABLE `core_userprofile`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`user_id`);

--
-- Индексы таблицы `core_watchhistory`
--
ALTER TABLE `core_watchhistory`
  ADD PRIMARY KEY (`id`),
  ADD KEY `core_watchhistory_film_id_ec15a71d_fk_core_film_id` (`film_id`),
  ADD KEY `core_watchhistory_user_id_b4db80c8_fk_auth_user_id` (`user_id`);

--
-- Индексы таблицы `django_admin_log`
--
ALTER TABLE `django_admin_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `django_admin_log_content_type_id_c4bce8eb_fk_django_co` (`content_type_id`),
  ADD KEY `django_admin_log_user_id_c564eba6_fk_auth_user_id` (`user_id`);

--
-- Индексы таблицы `django_content_type`
--
ALTER TABLE `django_content_type`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `django_content_type_app_label_model_76bd3d3b_uniq` (`app_label`,`model`);

--
-- Индексы таблицы `django_migrations`
--
ALTER TABLE `django_migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `django_session`
--
ALTER TABLE `django_session`
  ADD PRIMARY KEY (`session_key`),
  ADD KEY `django_session_expire_date_a5c62663` (`expire_date`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `auth_group`
--
ALTER TABLE `auth_group`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `auth_group_permissions`
--
ALTER TABLE `auth_group_permissions`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `auth_permission`
--
ALTER TABLE `auth_permission`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT для таблицы `auth_user`
--
ALTER TABLE `auth_user`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `auth_user_groups`
--
ALTER TABLE `auth_user_groups`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `auth_user_user_permissions`
--
ALTER TABLE `auth_user_user_permissions`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `axes_accessattempt`
--
ALTER TABLE `axes_accessattempt`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `axes_accessfailurelog`
--
ALTER TABLE `axes_accessfailurelog`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `axes_accesslog`
--
ALTER TABLE `axes_accesslog`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `core_comment`
--
ALTER TABLE `core_comment`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=517;

--
-- AUTO_INCREMENT для таблицы `core_film`
--
ALTER TABLE `core_film`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT для таблицы `core_filmgenre`
--
ALTER TABLE `core_filmgenre`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=181;

--
-- AUTO_INCREMENT для таблицы `core_genre`
--
ALTER TABLE `core_genre`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `core_rating`
--
ALTER TABLE `core_rating`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1054;

--
-- AUTO_INCREMENT для таблицы `core_userprofile`
--
ALTER TABLE `core_userprofile`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT для таблицы `core_watchhistory`
--
ALTER TABLE `core_watchhistory`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `django_admin_log`
--
ALTER TABLE `django_admin_log`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `django_content_type`
--
ALTER TABLE `django_content_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `django_migrations`
--
ALTER TABLE `django_migrations`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `authtoken_token`
--
ALTER TABLE `authtoken_token`
  ADD CONSTRAINT `authtoken_token_user_id_35299eff_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `auth_group_permissions`
--
ALTER TABLE `auth_group_permissions`
  ADD CONSTRAINT `auth_group_permissio_permission_id_84c5c92e_fk_auth_perm` FOREIGN KEY (`permission_id`) REFERENCES `auth_permission` (`id`),
  ADD CONSTRAINT `auth_group_permissions_group_id_b120cbf9_fk_auth_group_id` FOREIGN KEY (`group_id`) REFERENCES `auth_group` (`id`);

--
-- Ограничения внешнего ключа таблицы `auth_permission`
--
ALTER TABLE `auth_permission`
  ADD CONSTRAINT `auth_permission_content_type_id_2f476e4b_fk_django_co` FOREIGN KEY (`content_type_id`) REFERENCES `django_content_type` (`id`);

--
-- Ограничения внешнего ключа таблицы `auth_user_groups`
--
ALTER TABLE `auth_user_groups`
  ADD CONSTRAINT `auth_user_groups_group_id_97559544_fk_auth_group_id` FOREIGN KEY (`group_id`) REFERENCES `auth_group` (`id`),
  ADD CONSTRAINT `auth_user_groups_user_id_6a12ed8b_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `auth_user_user_permissions`
--
ALTER TABLE `auth_user_user_permissions`
  ADD CONSTRAINT `auth_user_user_permi_permission_id_1fbb5f2c_fk_auth_perm` FOREIGN KEY (`permission_id`) REFERENCES `auth_permission` (`id`),
  ADD CONSTRAINT `auth_user_user_permissions_user_id_a95ead1b_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `core_comment`
--
ALTER TABLE `core_comment`
  ADD CONSTRAINT `core_comment_film_id_144ac814_fk_core_film_id` FOREIGN KEY (`film_id`) REFERENCES `core_film` (`id`),
  ADD CONSTRAINT `core_comment_user_id_a9a9430c_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `core_filmgenre`
--
ALTER TABLE `core_filmgenre`
  ADD CONSTRAINT `core_filmgenre_film_id_735b951b_fk_core_film_id` FOREIGN KEY (`film_id`) REFERENCES `core_film` (`id`),
  ADD CONSTRAINT `core_filmgenre_genre_id_120b0339_fk_core_genre_id` FOREIGN KEY (`genre_id`) REFERENCES `core_genre` (`id`);

--
-- Ограничения внешнего ключа таблицы `core_rating`
--
ALTER TABLE `core_rating`
  ADD CONSTRAINT `core_rating_film_id_ae4d1594_fk_core_film_id` FOREIGN KEY (`film_id`) REFERENCES `core_film` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `core_rating_user_id_0c12e4af_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `core_userprofile`
--
ALTER TABLE `core_userprofile`
  ADD CONSTRAINT `core_userprofile_user_id_5141ad90_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `core_watchhistory`
--
ALTER TABLE `core_watchhistory`
  ADD CONSTRAINT `core_watchhistory_film_id_ec15a71d_fk_core_film_id` FOREIGN KEY (`film_id`) REFERENCES `core_film` (`id`),
  ADD CONSTRAINT `core_watchhistory_user_id_b4db80c8_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);

--
-- Ограничения внешнего ключа таблицы `django_admin_log`
--
ALTER TABLE `django_admin_log`
  ADD CONSTRAINT `django_admin_log_content_type_id_c4bce8eb_fk_django_co` FOREIGN KEY (`content_type_id`) REFERENCES `django_content_type` (`id`),
  ADD CONSTRAINT `django_admin_log_user_id_c564eba6_fk_auth_user_id` FOREIGN KEY (`user_id`) REFERENCES `auth_user` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
